[
  [
    [
      "The Exorcist is an American anthology horror drama television series that debuted on Fox on September 23, 2016. The series stars Alfonso Herrera, Ben Daniels and Geena Davis, and is based on the William Peter Blatty novel of the same name. A sequel to the 1973 film of the same name, it is part of \"The Exorcist\" franchise. It was commissioned on May 10, 2016. ",
      " Alan Douglas Ruck (born July 1, 1956) is an American actor. He played Cameron Frye, Ferris Bueller's hypochondriac best friend in John Hughes' \"Ferris Bueller's Day Off\" (1986), and Stuart Bondek, the lecherous, power-hungry member of the mayor's staff in the ABC sitcom \"Spin City\". His other notable films include \"Bad Boys\" (1983), \"Three Fugitives\" (1989), \"Young Guns II\" (1990), \"Speed\" (1994), \"Twister\" (1996), and \"Kickin' It Old Skool\" (2007). In 2016, he co-starred with Geena Davis in an updated Fox TV adaptation of William Peter Blatty's best-selling novel \"The Exorcist.\"  "
    ],
    "1973",
    "Alan Ruck co-starred in an updated TV adaptation of the horror series that was a sequel to the film released in what year?"
  ],
  [
    [
      "Adam Nergal Darski (born Adam Michał Darski; 10 June 1977 in Gdynia) is a Polish musician and television personality, best known for being the frontman for the black/death metal band Behemoth. ",
      " Pierre Charles Bouvier {'1': \", '2': \", '3': \", '4': \"} (born 9 May 1979) is a Canadian singer, songwriter, musician, composer and actor who is best known as the lead singer and guitarist of the rock band Simple Plan.  "
    ],
    "yes",
    "Are Adam Darski and Pierre Bouvier in the same industry?"
  ],
  [
    [
      "Whitetop Mountain is the second highest independent mountain in the U.S. state of Virginia, after nearby Mount Rogers. It is also the third highest named peak in Virginia, after Mount Rogers and its subsidiary peak, Pine Mountain. It is located at the juncture of Grayson, Smyth, and Washington Counties, and is also within the Mount Rogers National Recreation Area of the Jefferson National Forest. Whitetop was the location of the White Top Folk Festival from 1932 to 1939, with the exception of 1937. Like nearby Mount Rogers, it represents an ecological \"island\" of flora and fauna commonly found much further north than Virginia, such as old growth red spruce and other northern softwoods. ",
      " Mount Rogers is the highest natural point in the Commonwealth of Virginia, United States, with a summit elevation of 5729 ft above mean sea level. The summit straddles the border of Grayson and Smyth Counties, Virginia, about 6.45 mi WSW of Troutdale, Virginia. Most of the mountain is contained within the Lewis Fork Wilderness, while the entire area is part of the Mount Rogers National Recreation Area, which itself is a part of the Jefferson National Forest.  "
    ],
    "Mount Rogers",
    "Whitetop Mountain is the second-tallest mountain in Virginia behind which peak, near Troutdale?"
  ],
  [
    [
      "Puyo Puyo (ぷよぷよ , Puyo Puyo ) is a puzzle video game released in 1991 by Compile for the MSX2. Since its creation, it uses characters from \"Madou Monogatari\". It was created by Masamitsu \"Moo\" Niitani, the founder of Compile, who was inspired by certain elements from the \"Tetris\" and \"Dr. Mario\" series of games. ",
      " Tetris (Russian: Те́трис , pronounced ] ) is a tile-matching puzzle video game, originally designed and programmed by Russian game designer Alexey Pajitnov. It was released on June 6, 1984, while he was working for the Dorodnitsyn Computing Centre of the Academy of Science of the USSR in Moscow. He derived its name from the Greek numerical prefix \"tetra-\" (all of the game's pieces contain four segments) and tennis, Pajitnov's favorite sport.  "
    ],
    "Russian",
    "Of what origin is the name of the Russian game that inspired Puyo Puyo?"
  ],
  [
    [
      "The Russian Spaniel is a type of spaniel first standardised in 1951 in the Soviet Union after World War II by cross breeding English Cocker Spaniels, English Springer Spaniels and other spaniel breeds. Physically it is similar to a Cocker Spaniel, but has a shorter, tighter coat and a longer body. Developed and used as hunting dogs, this breed does not suffer from any major health complaints other than those normally associated with spaniels. Popular in its native Russia, the breed was only introduced overseas in the 1990s, and is not yet recognised by any major kennel clubs. ",
      " The Elo is an emerging breed of dog, with development beginning in 1987 in Germany. The breed name is trademarked and development has been closely supervised by the Elo Breeding and Research Association. The Elo is notable in that it is primarily selected and bred according to behavioral characteristics and social behavior, with the goal of creating the best family pet.  "
    ],
    "breed of dog",
    "What are both a Russian Spaniel and an Elo?"
  ],
  [
    [
      "Antonio Comi (born 26 July 1964) is a retired Italian professional footballer who played as a central midfielder and the current general manager of Torino. ",
      " Torino Football Club (] ), commonly referred to as Torino or simply Toro, is a professional Italian football club based in Turin, Piedmont, that plays in Serie A.  "
    ],
    "Turin, Piedmont",
    "Antonio Comi is the current general manager of a football club based in what city?"
  ],
  [
    [
      "The Evil Eye is a 1920 American action film serial directed by J. Gordon Cooper and Wally Van. It starred boxer Benny Leonard. It is considered to be a lost film. ",
      " Benny Leonard (born Benjamin Leiner; April 7, 1896 – April 18, 1947) was an Jewish American professional lightweight boxer. Widely considered one of the all-time greats, he was ranked 8th on \"The Ring\" magazine's list of the \"80 Best Fighters of the Last 80 Years\" and placed 7th in ESPN's \"50 Greatest Boxers of All-Time\". In 2005, the International Boxing Research Organization ranked Leonard as the #1 lightweight, and #8 best pound-for-pound fighter of all-time. Statistical website BoxRec rates Leonard as the 2nd best lightweight ever, while \"The Ring\" magazine founder Nat Fleischer placed him at #2. Boxing historian Bert Sugar placed him 6th in his Top 100 Fighters catalogue. Leonard is a member of the National Jewish Sports Hall of Fame, the International Jewish Sports Hall of Fame, the Ring Magazine Hall of Fame, the World Boxing Hall of Fame, and the International Boxing Hall of Fame.  "
    ],
    "Benny Leonard",
    "Which person associated with \"The Evil Eye\" film is in the National Jewish Sports Hall of Fame?"
  ],
  [
    [
      "Romeo and Juliet is a tragedy written by William Shakespeare early in his career about two young star-crossed lovers whose deaths ultimately reconcile their feuding families. It was among Shakespeare's most popular plays during his lifetime and along with \"Hamlet\", is one of his most frequently performed plays. Today, the title characters are regarded as archetypal young lovers. ",
      " A Ham in a Role is a Looney Tunes short starring the Goofy Gophers along with an unnamed dog who is based on stage/film actor John Barrymore. The cartoon was directed by Robert McKimson. It was released by Warner Bros. Pictures on December 13, 1949, but some sources list the release date as December 31, 1949. The cartoon draws heavily from the works of William Shakespeare, with its gags relying on literal interpretations of lines from Hamlet, Julius Caesar, Richard III, and Romeo and Juliet.  "
    ],
    "lovers",
    "A Ham in a Role is a Looney Tunes short that draws heavily from a tragedy about two young star-crossed what?"
  ],
  [
    [
      "James Francis \"Jimmy\" Cagney Jr. (July 17, 1899March 30, 1986) was an American actor and dancer, both on stage and in film, though he had his greatest impact in film. Known for his consistently energetic performances, distinctive vocal style, and deadpan comic timing, he won acclaim and major awards for a wide variety of performances. He is best remembered for playing multifaceted tough guys in movies such as \"The Public Enemy\" (1931), \"Taxi!\" (1932), \"Angels with Dirty Faces\" (1938), and \"White Heat\" (1949), and was typecast or limited by this view earlier in his career. In 1999, the American Film Institute ranked him eighth among its list of greatest male stars of Classic Hollywood Cinema. Orson Welles said of Cagney, \"[he was] maybe the greatest actor who ever appeared in front of a camera\", and Stanley Kubrick considered him to be one of the best actors of all time. ",
      " Cyril Raker Endfield (November 10, 1914 – April 16, 1995) was an American screenwriter, film director, theatre director, author, magician and inventor, based in Britain from 1953.  "
    ],
    "no",
    "Were both James Cagney and Cy Endfield magicians?"
  ],
  [
    [
      "David Allan Feamster (born September 10, 1958 in Detroit, Michigan) is an American retired ice hockey player who played for the Chicago Black Hawks. He was picked in the 1978 NHL Amateur Draft, after coming through Colorado College and made his debut in 1982. He retired in 1985 and currently owns five Little Caesars pizzerias in Pueblo, Colorado, where he was featured in Eric Schlosser's book \"Fast Food Nation\" ",
      " Little Caesar Enterprises Inc. (doing business as Little Caesars) is the third-largest pizza chain in the United States, behind Pizza Hut and Domino's Pizza. It operates and franchises pizza restaurants in the United States and internationally in Asia, the Middle East, Australia, Canada, Latin America and the Caribbean. The company was founded in 1959 and is based in Detroit, Michigan, headquartered in the Fox Theatre building in Downtown. Little Caesar Enterprises, Inc. operates as a subsidiary of Ilitch Holdings, Inc.  "
    ],
    "Detroit, Michigan",
    "Dave Feamster currently owns five of the pizza chains that are based in what city?"
  ]
]