{"og_id":"5a81dacc55429926c1cdada0","contexts_w_ans":"Suite from Henry V is a 1963 orchestral arrangement of William Walton's musical score from the 1944 film \"Henry V\". The suite, arranged by Muir Mathieson, is in five movements, although the second and fourth movements had already appeared in string arrangement form in Walton's own Two Pieces for Strings from Henry V. <sep> Henry V is a 1944 British Technicolor film adaptation of <ans> William Shakespeare <ans>'s play of the same name. The on-screen title is The Chronicle History of King Henry the Fift with His Battell Fought at Agin Court in France (the title of the 1600 quarto edition of the play). It stars Laurence Olivier, who also directed. The play was adapted for the screen by Olivier, Dallas Bower, and Alan Dent. The score is by William Walton.","refq":"Who is the author of the play that was adapted into a film and featured the orchestral arrangement Suite from Henry V?","1hop_q":"Who wrote the play that the film Henry V is based on?","non_q":"The orchestral suite was an arrangement of the film adaptation of Henry V, which was adapted from the play.","random_q":"What is one song from Almost Alice that was based on a Hookah-Smoking being from Lewis Carrolls book Alice's Adventures in Wonderland?","annoq":"Who wrote the play that Muir Mathieson's Suite from Henry V is based on?","annoq_clue_refq":"Who wrote the play that was adapted into a film and later inspired the orchestral arrangement Suite from Henry V?"}
{"og_id":"5ae27e19554299495565da8b","contexts_w_ans":"Robert Morgan Carlock (born 1972\/1973) is an American screenwriter and producer. He has worked as a writer for several NBC television comedies, as a show runner for \"30 Rock\", and as a co-creator of \"Unbreakable Kimmy Schmidt\". <sep> Unbreakable Kimmy Schmidt is an American television sitcom created by Tina Fey and Robert Carlock, starring <ans> Ellie Kemper <ans> in the title role, that has streamed on Netflix since March 6, 2015. Originally set for a 13-episode first season on NBC for spring 2015, the show was sold to Netflix and given a two-season order.","refq":"Who stars in the title role of a Netflix show co-created by Robert Carlock?","1hop_q":"Who stars in the title role of Unbreakable Kimmy Schmidt?","non_q":"Robert Carlock co-created the show \"Unbreakable Kimmy Schmidt\" starring Ellie Kemper on Netflix.","random_q":"While kosher companies Streit's and Manischewitz are both famous matzo competitors, Manischewitz. is also famous for what other product?","annoq":"Who played the main role in a show co-created by the show runner of \"30 Rock\" and Tina Fey?","annoq_clue_refq":"Who starred in the title role of the Netflix show co-created by Robert Carlock?"}
{"og_id":"5a7b1bb5554299042af8f6d4","contexts_w_ans":"\"Fairytale of New York\" is a song written by Jem Finer and Shane MacGowan and first released as a single on 23 November 1987 by their band The Pogues, featuring singer-songwriter Kirsty MacColl on vocals. The song was written as a duet, with the Pogues' singer MacGowan taking the role of the male character and MacColl the female character. It is an Irish folk-style ballad, and featured on The Pogues' 1988 album \"If I Should Fall from Grace with God\". <sep> Jeremy Max \"Jem\" Finer (born 25 July <ans> 1955 <ans>) is an English musician, artist and composer. He was one of the founding members of The Pogues.","refq":"What year was the alphabetically first writer of Fairytale of New York born?","1hop_q":"What year was Jeremy Max \"Jem\" Finer born?","non_q":"Jem Finer, one of the founding members of The Pogues, was born in New York.","random_q":"What is the sixth largest city in Kansas, where the 1948 Kansas Jayhawks football team played their home games?","annoq":"In which year was the co-writer of \"Fairytale of New York\", working alongside Shane MacGowan, born?","annoq_clue_refq":"In which year was one of the first members of The Pogues who co-wrote \"Fairytale of New York\" born?"}
{"og_id":"5a893f305542993b751ca91e","contexts_w_ans":"St. George is a town in Knox County, Maine, United States. The population was 2,591 at the 2010 Census. It includes the villages of Port Clyde, Clark Island, Glenmere, Martinsville and Tenants Harbor, the latter its commercial center. A favorite with artists, writers and naturalists, St. George is home to the Brothers and Hay Ledge nature preserve, comprising four islands off Port Clyde. <sep> Whitehead Light is a lighthouse on Whitehead Island, on Muscle Ridge Channel, in the southwestern entrance to Penobscot Bay, Maine. It is in the town of <ans> St.George <ans>. Established in 1807, it is one of Maine's oldest light stations, with its present tower built in 1852 to a design attributed to Alexander Parris. It was listed on the National Register of Historic Places as Whitehead Light Station on March 14, 1988. The property is now privately owned by Pine Island Camp, which conducts outings to the facility. The light itself remains an active aid to navigation, maintained by the United States Coast Guard.","refq":"The Whitehead Light is located in what town with a population of 2,591 during the 2010 census?","1hop_q":"What town is Whitehead Light located in?","non_q":"The town of St. George had a population of 2,591 according to the 2010 Census, including Whitehead Light.","random_q":"Roaring Rapids is a river rapids ride located at Six Flags Magic Mountain in which state?","annoq":"In which town are the Brothers and Hay Ledge nature preserve and Whitehead Light located?","annoq_clue_refq":"Which town , with a population of 2591 at the 2010 Census, hosts Whitehead Light?"}
{"og_id":"5ae554ce55429960a22e02b7","contexts_w_ans":"Lari Michele White ( ; born May 13, 1965) is an American country music artist and actress. She first gained national attention in 1988 as a winner on \"<ans> You Can Be a Star <ans>\", a talent competition which aired on The Nashville Network. A recording contract with RCA Records Nashville followed a year later, producing three studio albums, a greatest hits package, and several chart singles, with three of her singles having reached Top Ten: \"That's My Baby\" and \"That's How You Know (When You're In Love)\" at No. 10, and \"Now I Know\" at No. 5. A fourth studio album was released in 1998 on Lyric Street Records, followed by two more releases on White's own label, Skinny White Girl. Overall, White has charted 12 times on the \"Billboard\" country music charts. <sep> \"I Will Not Say Goodbye\" is a song written by Lari White, Chuck Cannon and Vicky McGehee, and recorded by \"American Idol\" season 8 finalist Danny Gokey. It was released in June 2010 as the second single from his debut album \"My Best Days\", which was released on March 2, 2010 via RCA Nashville.","refq":" \"I Will Not Say Goodbye\" is a song written in part by a music artist who first gained national attention as a winner of what talent competition?","1hop_q":"What talent competition did Lari Michele White win in 1988?","non_q":"Lari White, a talented artist in country music, first gained national attention as a competition winner.","random_q":"What type of film are Chronique d'un été and Fairytale of Kathmandu classified as?","annoq":"Which 1988 competition did a co-writer of \"I Will Not Say Goodbye become a winner of?","annoq_clue_refq":"The artist who wrote \"I Will Not Say Goodbye\" first gained national attention as a winner of which talent competition?"}
{"og_id":"5a8031c1554299485f598585","contexts_w_ans":"<ans> Sofia the First <ans> is an American animated television series produced for Disney Channel. Jamie Mitchell is the Director and Executive Producer and Craig Gerber serves as Story Editor and Producer. The show follows the adventures of Sofia, played by Ariel Winter. Sofia becomes a princess when her mother, Miranda, marries King Roland II of Enchantia. The show features songs by John Kavanaugh and Erica Rothschild and a musical score by Kevin Kliesch. <sep> Meghan Strange is an American actress and voice actress. She is best known for her roles as Ruby from \"The Land Before Time\" television series and Robin from \"<ans> Sofia the First <ans>\". She also voiced the character Harley Quinn on \"\" and has appeared in a number of short films and children's TV shows.","refq":"Meghan Strange is an American actress and voice actress, known for her role as Robin on what American animated television series produced for Disney Channel?","1hop_q":"Who is played by Ariel Winter?","non_q":"Meghan Strange is an American actress and voice actress known for her roles as Robin in the animated television series \"Sofia the First\".","random_q":"Who produced the Orianthi single which peaked at No. 3 in Japan?","annoq":"In which show, with Jamie Mitchell as the Director and Executive Producer and Craig Gerber serves as Story Editor and Producer, did Meghan Strange play the role of Robin?","annoq_clue_refq":"In which show produced by Disney Channel did American voice actress Meghan Strange play the role of Robin?"}
{"og_id":"5adc983c5542990d50227cb6","contexts_w_ans":"Manaus (] ] ) or Manaós before 1939 or (formerly) Barra do Rio Negro, is the capital city of the state of Amazonas in the North Region of <ans> Brazil <ans>. It is situated near the confluence of the Negro and Solimões rivers. With a population of more than 2 million, it is the most populous city of both the <ans> Brazil <ans>ian state of Amazonas and the Amazon rainforest. <sep> Sul América Esporte Clube, commonly known as Sul América, is a <ans> Brazil <ans>ian football club based in Manaus, Amazonas. They won the Campeonato Amazonense two times and competed in the Copa do Brasil once.","refq":"In what Country is Sul America Esporte Clube in?","1hop_q":"What country is Manaus located in?","non_q":"Sul América is a football club in Manaus that competes in the Campeonato Amazonense.","random_q":"How long was the NBA career of the player named NBA Finals MVP in the 1999 NBA Playoffs ?","annoq":"Which country owns a football club that is based in the most populous city of the Amazon rainforest and won the Campeonato Amazonense two times?","annoq_clue_refq":"Which country does Sul America Esporte Clube come from?"}
{"og_id":"5abd72d155429933744ab7e0","contexts_w_ans":"William Friedkin (born August 29, 1935) is an American <ans> film <ans> director, producer and screenwriter best known for directing \"The French Connection\" in 1971 and \"The Exorcist\" in 1973; for the former, he won the Academy Award for Best Director. Some of his other <ans> film <ans>s include \"Sorcerer\", \"Cruising\", \"To Live and Die in L.A.\", \"Jade\", \"Rules of Engagement\", \"The Hunted\", \"Bug\", and \"Killer Joe\". <sep> Jon Paul Puno (born 1985) is an American <ans> film <ans>maker and classical crossover singer. As a <ans> film <ans>maker, he has directed <ans> film <ans>s such as Valle de Lágrimas (2006) and Peace Grows (2004). And also played a small role in the 2006 movie I Will Always Love You (<ans> film <ans>).","refq":"Both William Friedkin and Jon Paul Puno are both directors of which type of media?","1hop_q":"What did William Friedkin direct?","non_q":"William Friedkin is a director, while Jon Paul Puno is a filmmaker and singer.","random_q":"The artist who wrote the song \"Silver Springs\", which was released as a single from the 1997 album \"The Dance\", was born in which year?","annoq":"Which art form do William Friedkin and Jon Paul Puno both work on?","annoq_clue_refq":"Which art form do William Friedkin and Jon Paul Puno both work on as directors?"}
{"og_id":"5ab2d3c5554299295394687a","contexts_w_ans":"Isaac Liev Schreiber ( ; born October 4, 1967), better known as Liev Schreiber, is an American actor, director, screenwriter, and producer. He became known during the late 1990s and early 2000s, having appeared in several independent films, and later mainstream Hollywood films, including the \"Scream\" trilogy of horror films, \"Ransom\" (1996), \"Phantoms\" (1998), \"The Sum of All Fears\" (2002), \"The Omen\" (2006), \"\" (2009), \"Taking Woodstock\" (2009), \"Salt\" (2010), \"Goon\" (2011), \"Pawn Sacrifice\" (2014), and \"Spotlight\" (2015). <sep> Salt is a 2010 American action thriller film directed by <ans> Phillip Noyce <ans>, written by Kurt Wimmer, and starring Angelina Jolie, Liev Schreiber, Daniel Olbrychski, August Diehl, and Chiwetel Ejiofor. Jolie plays Evelyn Salt, who is accused of being a Russian sleeper agent and goes on the run to try to clear her name.","refq":"Isaac Live Schreiber, better known as Live Schrieber, acted in Salt, a 2010 American action thriller film directed by whom?","1hop_q":"Who directed Salt?","non_q":"Isaac Schreiber is better known for his role in the 2010 American action thriller film, Salt.","random_q":"What do the Lost McLeod Mine and the Colomac Mine have in common?","annoq":"Who directed the 2010 Hollywood film in which Liev Schreiber play a role?","annoq_clue_refq":"Who directed the 2010 American action thriller film in which Isaac Liev Schreiber, better known as Liev Schreiber, play a role?"}
{"og_id":"5ab520dd5542996a3a96a02c","contexts_w_ans":"The Republican Party, commonly referred to as the GOP (abbreviation for Grand Old Party), is one of the two major contemporary political parties in the United States, the other being its historic rival, the Democratic Party. The party is named after republicanism, the dominant value during the American Revolution. Founded by anti-slavery activists, economic modernizers, ex-Whigs, and ex-Free Soilers in 1854, the Republicans dominated politics nationally and in the majority of northern states for most of the period between 1860 and 1932. <sep> George D. Maziarz (born May 25, 1953) is a Republican politician from <ans> New York <ans> State. He formerly represented the 62nd District in the <ans> New York <ans> State Senate, which includes all of Niagara County, all of Orleans County, and the towns of Sweden and Ogden in Monroe County.","refq":"Which US State, hIstorically dominated by the Republican party from 1860 to 1932 is represented by State Senator George D. Maziarz?","1hop_q":"What state does George D. Maziarz represent?","non_q":"George D. Maziarz represented the Republican Party in the New York State Senate.","random_q":"St. Charles Borromeo Church is located on which Native American tribe's land?","annoq":"George D. Maziarz is a representative of the GOP for which state?","annoq_clue_refq":"Which state did George D. Maziarz from the Republican party, the historically dominant party from 1860 and 1932, represent?"}
{"og_id":"5a7293655542991f9a20c4ff","contexts_w_ans":"David Brock (born November 2, 1962) is an American Neo-Liberal political operative, author, and commentator who founded the media watchdog group Media Matters for America. He has been described by \"Time\" as \"one of the most influential operatives in the Democratic Party\". <sep> <ans> The Seduction of Hillary Rodham <ans> is a 1996 book about the early years of Hillary Rodham Clinton written by David Brock.","refq":"What 1996 book was written by the founder of Media Matter for America?","1hop_q":"What is the name of the book about the early years of Hillary Rodham Clinton written by David Brock?","non_q":"David Brock founded Media Matters for America, a media watchdog group, and wrote a book in 1996.","random_q":"Which state was the composer, who wrote the music and lyrics to \"Around the World,\" born?","annoq":"Which book about the early years of Hillary Rodham Clinton was written by the founder of Media Matters for America?","annoq_clue_refq":"Which 1996 book was written by the founder of Media Matters for America?"}
{"og_id":"5ae22b8d554299234fd0440f","contexts_w_ans":"Peter Bolesław Schmeichel MBE (] ; born 18 November 1963) is a Danish former professional footballer who played as a goalkeeper, and was voted the IFFHS <ans> World's Best Goalkeeper <ans> in 1992 and 1993. He is best remembered for his most successful years at English club Manchester United, whom he captained to the 1999 UEFA Champions League to complete the Treble, and for winning UEFA Euro 1992 with Denmark. <sep> Kasper Peter Schmeichel (] ; born 5 November 1986) is a Danish professional footballer who plays as a goalkeeper for Premier League club Leicester City and the Denmark national team. He is the son of former Manchester United and Danish international goalkeeper Peter Schmeichel.","refq":"What was the father of Kasper Schmeichel voted to be by the IFFHS in 1992?","1hop_q":"What was Peter Schmeichel voted in 1992 and 1993?","non_q":"Kasper Schmeichel was voted IFFHS in 1992, just like his father, Peter.","random_q":"Who won the Australian federal election, 1998 to become the 25th Prime Minister of Australia?","annoq":"Which IFFHS title did Kasper Schmeichel's father win in 1992 and 1993?","annoq_clue_refq":"Which IFFHS title was Kasper Schmeichel's father voted in 1992?"}
{"og_id":"5adf35935542993344016c36","contexts_w_ans":"Starrcade (1992): BattleBowl\/The Lethal Lottery II was a major annual professional wrestling show, broadcast on pay-per-view (PPV) that took place on December 28, 1992, from The Omni in Atlanta, Georgia. The show was produced by World Championship Wrestling (WCW) and was the 10th overall show under that banner since its inception in 1983. The focus of the show was the second ever \"Lethal Lottery\" \/ \"Battle Bowl\" tournament where randomly paired tag teams competed for a spot in the Battle Bowl battle royal at the end of the night. The show also saw Ron Simmons defend the WCW World Heavyweight Championship against <ans> \"Dr. Death\" Steve Williams <ans>, the team of Shane Douglas and Ricky Steamboat putting the WCW World Tag Team Championship on the line against the team of Brian Pillman and Barry Windham and Masahiro Chono defend the NWA World Heavyweight Championship against The Great Muta. In addition Sting faced off against Vader in the finals of the \"\"King of Cable\"\" tournament. <sep> Steven Williams (May 14, 1960 – December 29, 2009), better known by his ring name <ans> \"Dr. Death\" Steve Williams <ans>, was an American professional wrestler, author, former collegiate football player, and amateur wrestler at the University of Oklahoma. Dr. Death was a three-time professional wrestling world heavyweight champion, having won the UWF World Heavyweight Championship twice and the Triple Crown Heavyweight Championship once. In addition to his singles success, Dr. Death achieved notoriety in Japan in tag team competition, winning the World Tag Team Championship eight times with notable tag team partners Terry Gordy, Gary Albright, Vader, and Johnny Ace. He also achieved great tag team success in North America, winning tag team titles in the Mid-South, World Championship Wrestling, UWF and NWA United States Tag Team Championship as well as winning the World's Strongest Tag Determination League twice with Gordy and Mike Rotunda.","refq":"Which wrestler, who died in 2009, featured on the wrestling show Starrcade?","1hop_q":"Who did Ron Simmons defend the WCW World Heavyweight Championship against?","non_q":"In 2009, a wrestler known as \"Dr. Death\" Steve Williams participated in the Starrcade wrestling show.","random_q":"Who have more species of plants, Manettia or Guzmania?","annoq":"Which three-time professional wrestling world heavyweight champion appears in Starrcade?","annoq_clue_refq":"Which wrestler appearing in Starrcade die in 2009?"}
{"og_id":"5a7ae38c5542992d025e6721","contexts_w_ans":"Don Oliver Newland (1896–1951) was an American film director and producer whose career consisted largely of itinerant work. From the 1920s until his death, he traveled to cities throughout the United States making films that employed local citizens as stars and extras. Using a standard script, Newland personalized each film according to its location – \"Belvidere's Hero\", \"Staunton's Hero\", \"Janesville's Hero\", \"Huntingdon's Hero\", \"Tyrone's Hero\", \"Wilmington's Hero\", and so on. <sep> <ans> Teinosuke Kinugasa <ans> (衣笠 貞之助 , Kinugasa Teinosuke ) (1 January 1896 – 26 February 1982) was a Japanese actor and film director. He was born in Kameyama, Mie Prefecture and died in Kyoto. Kinugasa won the 1954 Palme d'or at Cannes for \"Jigokumon\" (\"The Gate of Hell\").","refq":"Who was older when they died, Teinosuke Kinugasa or Don O. Newland","1hop_q":"Who won the Palme d'or at Cannes in 1954?","non_q":"Teinosuke Kinugasa died in Kyoto, while Newland was an American film director.","random_q":"Who is younger Víctor García or Lee Sung-min ?","annoq":"Which Japanese actor, winning the 1954 Palme d'or at Cannes, was born in the same year as Don Oliver Newland?","annoq_clue_refq":"Who died later, Newland or Teinosuke Kinugasa?"}
{"og_id":"5ade66e1554299728e26c713","contexts_w_ans":"The Medellín Cartel was a ruthless, highly organized and much-feared Colombian drug cartel originating in the city of Medellín, Colombia. The drug cartel operated throughout the <ans> 1970s and 1980s <ans> in Bolivia, Colombia, Central America, Peru, and the United States, as well as in Canada and Europe. It was founded and run by Ochoa Vázquez brothers Jorge Luis, Juan David, and Fabio, together with Pablo Escobar, George Jung, Carlos Lehder and José Gonzalo Rodríguez Gacha. By 1993, the resistance group, Los Pepes (or PEPES), controlled by the Cali Cartel, and the Colombian government, in collaboration with the Cali Cartel, right-wing paramilitary groups, and the United States government, had dismantled the Medellín Cartel by imprisoning or assassinating its members. <sep> José Gonzalo Rodríguez Gacha (May 14, 1947 – December 15, 1989), also known by the nickname \"El Mexicano\", was a Colombian drug lord who was one of the leaders of the notorious Medellín Cartel along with the Ochoa Brothers and Pablo Escobar. At the height of his criminal career Rodríguez was acknowledged as one of the world's most successful drug dealers. In 1988, \"Forbes\" magazine included him in their annual list of the world's billionaires.","refq":"What years did Jose Gonzalo Rodriguez Gacha and other leaders of fthe Medallin Cartel operate in Boliva, Colombia, Central America, Peru, the United States, Canada, and Europe?","1hop_q":"During what time period did the Medellín Cartel operate?","non_q":"The Medellín Cartel, led by Gonzalo Gacha, operated in Colombia, Central America, Peru, United States, Canada, and Europe.","random_q":"In which city did the brother of Karan Kapoor run the Prithvi Theatre?","annoq":"During which time periods did \"El Mexicano\" co-run the Medellín Cartel?","annoq_clue_refq":"During which time periods did Jose Gonzalo Rodriguez Gacha, along with other leaders, operated a cartel in Bolivia, Colombia, Central America, Peru, and the United States, as well as in Canada and Europe?"}
{"og_id":"5ac313145542995ef918c0ed","contexts_w_ans":"Farewell, My Queen (French: Les Adieux à la reine ) is a 2012 French drama film directed by <ans> Benoît Jacquot <ans> and based on the novel of the same name by Chantal Thomas, who won the \"Prix Femina\" in 2002. It gives a fictional account of the last days of Marie Antoinette in power seen through the eyes of Sidonie Laborde, a young servant who reads aloud to the queen. The film stars Diane Kruger as the Queen, Léa Seydoux, and Virginie Ledoyen. <sep> Chantal Thomas (born 1945, in Lyon) is a French writer and historian. Her 2002 book, \"Farewell, My Queen\", won the Prix Femina and was adapted into a 2012 film starring Diane Kruger and Léa Seydoux.","refq":"Chantal Thomas wrote a book that was turned into a 2012 film directed by whom?","1hop_q":"Who directed \"Farewell, My Queen\"?","non_q":"The 2012 film, directed by Chantal Thomas, was based on her book \"Farewell, My Queen.\"","random_q":"Which composer, who won an Emmy award, shared a stage with Groucho Marx at Carnegie Hall in 1972?","annoq":"Who directed the movie adaptation of Chantal Thomas's \"Farewell, My Queen\"?","annoq_clue_refq":"Who directed the 2012 film version of Chantal Thomas's book?"}
{"og_id":"5a89ba6b554299669944a584","contexts_w_ans":"Coronation Street (informally known as Corrie) is a British soap opera created by Granada Television and shown on <ans> ITV <ans> since 9 December 1960. The programme centres on Coronation Street in Weatherfield, a fictional town based on inner-city Salford, its terraced houses, café, corner shop, newsagents, building yard, taxicab office, salon, restaurant, textile factory and the Rovers Return pub. In the show's fictional history, the street was built in 1902 and named in honour of the coronation of King Edward VII. <sep> Philippa (Pippa) Lucy Hinchley (born 7 April 1966) is an English actress who played Elaine Fenwick in \"Coronation Street\". She has also been in \"The Bill\", \"Bugs\", \"Doctors\", \"Holby City\" and \"EastEnders\". One of her earliest TV roles was as a teenaged holidaymaker in Michael Palin's drama \"East of Ipswich\" (1986), set in Southwold in the 1950s. She also appeared in the films \"Secret Places\" (1984), \"Dead Man's Folly\" (1986) and \"The Dressmaker\" (1988), and on TV in \"Last of the Summer Wine\", \"People Like Us\" and \" Touch\".","refq":"Pippa Hinchleyplayed Elaine Fenwick on a British Soap opera shown on what channel?","1hop_q":"What channel is Coronation Street shown on?","non_q":"Pippa Hinchley, known for her role as Elaine Fenwick, appeared in the British soap opera.","random_q":"What actress is known for portraying a countess in British television as well as an American chorus girl?","annoq":"On which TV station was the soap opera featuring Philippa (Pippa) Lucy Hinchley's portrayal of Elaine Fenwick aired?","annoq_clue_refq":"On which TV station was the British soap opera featuring Pippa as Elaine Fenwick aired?"}
{"og_id":"5ae3f0c85542995ad6573cb1","contexts_w_ans":"Joanne is the fifth studio album by American singer Lady Gaga. It was released on <ans> October 21, 2016 <ans>, by Streamline and Interscope Records. Gaga collaborated with several producers on the album, including Mark Ronson, Jeff Bhasker, BloodPop and RedOne, and co-produced the majority of the material. The music of \"Joanne\" features \"stripped-down\" soft rock and dance-pop styles in order to emphasize the singer's vocal abilities. Lyrically, the album delves on the theme of family and life's emotions, with the death of her aunt, Joanne Stefani Germanotta, having a deep influence on the record. <sep> The Super Bowl LI Halftime show took place on February 5, 2017, at NRG Stadium in Houston, Texas as part of Super Bowl LI. The show was headlined by Lady Gaga, who performed a medley of her songs, including newer material from her most recent studio album \"Joanne\".","refq":"When was the album released for which Lady Gaga used for material for her Super Bowl LI halftime show?","1hop_q":"When was \"Joanne\" released?","non_q":"Lady Gaga's album \"Joanne\" was released before her Super Bowl LI Halftime show.","random_q":"Are the following Polish political parties more right or left winged, Poland Comes First or Law and Justice?","annoq":"When was Lady Gaga's most recent album before her performance at the Super Bowl Halftime show released?","annoq_clue_refq":"When was the newer material performed by Lady Gaga in the Super Bowl LI Halftime show released?"}
{"og_id":"5a72a9ac5542991f9a20c55f","contexts_w_ans":"Brian Balthazar is a TV personality and the executive producer and developer of several programs on broadcast and cable television. He has frequently appeared on television as the editor of the website POPgoesTheWeek.com on The Wendy Williams Show, The Today Show on NBC, VH1, CNN, TV Guide Network and Showbiz Tonight on HLN. He has also hosted specials for HGTV. In summer of 2014 he became co-executive producer of ABC's The View. As a television executive and producer, he was HGTV's network executive overseeing the popular series House Hunters and launched <ans> the fourth hour of the TODAY Show <ans> on NBC with Kathie Lee Gifford and Hoda Kotb <sep> Hoda Kotb ( ; Arabic: هدى قطب‎ ‎  \"Hudā Quṭb\" ] , born August 9, 1964) is an American television news anchor and TV host known as the co-host of NBC's \"Today Show\"' s fourth hour with Kathie Lee Gifford. An Egyptian American, she won a Daytime Emmy Award in 2010 as part of the \"Today Show\" team. Kotb is also a correspondent for \"Dateline NBC\".","refq":"Which show co-hosted by Hoda Kotb was produced by Brian Balthazar?","1hop_q":"What did Brian Balthazar launch on NBC with Kathie Lee Gifford and Hoda Kotb?","non_q":"Brian Balthazar was the co-host of \"The Today Show\" and also hosted with Hoda Kotb.","random_q":"What is this region highly contested between Poland and Lithuania called in Polish where Lithuanian Education Society Rytas is located?","annoq":"Which segment of the \"Today Show\" launched by Brian Balthazar contributed to its win of the Daytime Emmy Award in 2010?","annoq_clue_refq":"Which show was produced by Brian Balthazar with Hoda Kotb as the co-host?"}
{"og_id":"5a8656ca554299211dda2afc","contexts_w_ans":"Get Him to the Greek is a 2010 American black comedy film written, produced and directed by Nicholas Stoller and starring Russell Brand and Jonah Hill. Released on June 4, 2010, the film serves as a spin-off sequel of Stoller's 2008 film \"Forgetting Sarah Marshall\", reuniting director Stoller with stars Hill and Brand and producer Judd Apatow. Brand reprises his role as character Aldous Snow from \"Forgetting Sarah Marshall\", while Hill plays an entirely new character. The film also stars Elisabeth Moss, <ans> Rose Byrne <ans>, Sean \"Diddy\" Combs, and Colm Meaney. <sep> Mary <ans> Rose Byrne <ans> (born 24 July 1979) is an Australian actress. Byrne made her screen debut in 1992 with a small role in the film \"Dallas Doll\". In 2000, she played a leading role in the Australian film \"The Goddess of 1967\", which brought her the Volpi Cup for Best Actress. From 2007 to 2012, she played Ellen Parsons in the cable television series \"Damages\", which earned her two Golden Globe Award and two Primetime Emmy Award nominations. Along with co-star Glenn Close, she appeared in all of the show's fifty-nine episodes. Byrne has also starred in the films \"Troy\", \"28 Weeks Later\", \"Knowing\", \"Insidious\", \"\", \"\", as well as the comedies \"Get Him to the Greek\", \"Bridesmaids\", \"Neighbors\", \"\", and \"Spy.\"","refq":"Which black comedy sequel to \"Forgetting Sarah Marshall\" starred an Australian actress?","1hop_q":"Who is one of the stars in the film?","non_q":"\"Rose Byrne, an Australian actress, starred in the black comedy sequel 'Get Him to the Greek'.\"","random_q":"Are Sigurd Wongraven and Stevie Ray Vaughan both guitarists?","annoq":"Which actor from the series \"Damages\" stars in the spin-off sequel of \"Forgetting Sarah Marshall\"?","annoq_clue_refq":"Which Australian actress stars in the black comedy sequel of \"Forgetting Sarah Marshall\"?"}
{"og_id":"5a7dc7895542995ed0d16673","contexts_w_ans":"<ans> Milan Kundera <ans> (] ; born 1 April 1929) is a Czech-born French writer who went into exile in France in 1975, and became a naturalised French citizen in 1981. He \"sees himself as a French writer and insists his work should be studied as French literature and classified as such in book stores\". <sep> Joseph Epstein (born January 9, 1937) is an essayist, short-story writer, and editor. From 1974 to 1998 he was the editor of the magazine \"The American Scholar\".","refq":"Which writer is older, Joseph Epstein or Milan Kundera?","1hop_q":"Who is the Czech-born French writer?","non_q":"Joseph Epstein is an American essayist and editor, while Milan Kundera is a French writer.","random_q":"Campus Man, a 1987 American comedy film, starred which American actress known for her starring role on the ABC drama television series \"NYPD Blue\"?","annoq":"Who was born earlier, Milan Kundera or Joseph Epstein?","annoq_clue_refq":"Which writer was born earlier, Milan Kundera or Joseph Epstein?"}
{"og_id":"5a8d5fc6554299585d9e37c6","contexts_w_ans":"Sarah Lee Bolger (born 28 February 1991) is an Irish actress. She is best known for her roles in the films \"In America\", \"Stormbreaker\", and \"<ans> The Spiderwick Chronicles <ans>\", as well as her award-winning role as Lady Mary Tudor in the TV series \"The Tudors\", and for guest starring as Princess Aurora in \"Once Upon a Time\". <sep> <ans> The Spiderwick Chronicles <ans> is a 2008 American fantasy adventure film based on the bestselling book series of the same name by Holly Black and Tony DiTerlizzi. It was directed by Mark Waters and stars Freddie Highmore, Sarah Bolger, Mary-Louise Parker, Martin Short, Nick Nolte, and Seth Rogen. Set in the Spiderwick Estate in New England, it follows the adventures of Jared Grace and his family as they discover a field guide to faeries, battle goblins, mole trolls and other magical creatures.","refq":"What's the name of the fantasy film starring Sarah Bolger, featuring a New England family who discover magical creatures around their estate?","1hop_q":"Which film is Sarah Lee Bolger best known for her role in?","non_q":"Sarah Bolger stars in the fantasy film \"The Spiderwick Chronicles\" set in the New England Estate, where her family discovers magical creatures.","random_q":"whos family had their own reality tv show. Robert Kardashian or Manvel Gamburyan?","annoq":"Which film adaption of a book series stars the Irish actress who also appeared in \"In America\" and \"Stormbreaker\"?","annoq_clue_refq":"What is the name of the fantasy film that, starring Sarah Bolger, follows the journey of a family as they discover magical creatures in an estate in New England?"}
{"og_id":"5a876cd55542993e715abf36","contexts_w_ans":"Kim Jong-hyun (born April 8, 1990), better known by the mononym Jonghyun, is a South Korean singer-songwriter, and radio host. He is a vocalist of the South Korean boy group Shinee, and has further participated in S.M. Entertainment's project group S.M. The Ballad. Jonghyun debuted as a solo artist on January 12, 2015, with his first EP, titled \"Base\". In the same year, on September 17, Jonghyun released a compilation album, \"Story Op.1\". On May 24, 2016, Jonghyun released his first studio album, \"She Is\", followed by his second compilation album, \"Story Op.2\" on April 24, 2017. <sep> She Is (Hangul: 좋아 ; RR: \"Joh ah \" \"good\") is the first studio album by South Korean singer-songwriter Jonghyun, released on May 24, 2016 by S.M. Entertainment and distributed by <ans> KT Music <ans>.","refq":"Kim Jong-hyun's first studio album was distributed by whom?","1hop_q":"Who distributed the album?","non_q":"Jonghyun released his first studio album, \"She Is\", which was distributed by KT Music.","random_q":"In what year did the Austrian case to which the Mongelli case has been compared emerge?","annoq":"Which company is responsible for the distribution of Shinee's vocalist's first album \"She Is\"?","annoq_clue_refq":"Which company is responsible for the distribution of Kim Jong-hyun's first album?"}
{"og_id":"5abb326055429966062416e7","contexts_w_ans":"Ruddles Brewery (G. Ruddle & Co) was an English brewery. The brand is now owned by Greene King who still brew beers under the Ruddles name in Suffolk, although the current recipes are not those used at the original brewery. <sep> Greene King is the UK's largest pub retailer and brewer. It is based in <ans> Bury St Edmunds <ans>, Suffolk, England. The company owns pubs, restaurants and hotels. It is listed on the London Stock Exchange and is a constituent of the FTSE 250 Index.","refq":"Ruddles Brewery is owned by a pub retailer and brewer based in what city?","1hop_q":"Where is Greene King based?","non_q":"Ruddles Brewery, based in England, is owned by Greene King, the UK's largest pub retailer and brewer.","random_q":"In addition to Cloud Atlas and the 2016 war drama directed by Vincent Perez, what other film did Stefan Arndt produce?","annoq":"Where in Suffolk is the company that now owns Ruddles Brewery located?","annoq_clue_refq":"Where is the pub railer and brewer that now owns Ruddles Brewery located?"}
{"og_id":"5abe03635542991f661060a5","contexts_w_ans":"James <ans> David <ans> Lofton (born July 5, 1956) is a former American football player and coach. He is a former coach for the San Diego Chargers but is best known for his years in the National Football League as a wide receiver for the Green Bay Packers (1978–1986), Los Angeles Raiders (1987–1988), the Buffalo Bills (1989–1992), Los Angeles Rams (1993) and Philadelphia Eagles (1993). He was also the NCAA champion in the long jump in 1978 while attending Stanford University. Lofton was inducted into the Pro Football Hall of Fame in 2003. <sep> The 1977 Stanford Cardinals football team represented Stanford University during the 1977 NCAA Division I football season. Bill Walsh served his first season as Stanford's head coach. The Cardinals were led by senior quarterback Guy Benjamin, who won the Sammy Baugh Trophy, awarded to the best passer in college football; senior receiver James Lofton, who caught 57 passes for 1,010 yards and 14 TDs and was named an AP and NEA Second Team All-American; junior linebacker Gordy Ceresino, and freshman running back Darrin Nelson.","refq":"What is the middle name of the former Stanford Cardinals player who caught 57 passes for 1010 yards and 14 TDs?","1hop_q":"What is James Lofton's middle name?","non_q":"James Lofton, a former player for the Stanford Cardinals, caught 57 passes for 1,010 yards and 14 TDs.","random_q":"The person who appointed Eva Guzman to Place 9 on the Texas Supreme Court served in what president's cabinet?","annoq":"What is the middle name of the senior receiver of the 1977 Stanford Cardinals?","annoq_clue_refq":"Which former Stanford Cardinal caught caught 57 passes for 1,010 yards and 14 TDs?"}
{"og_id":"5a8ed87955429917b4a5bdd2","contexts_w_ans":"The Revolutionary is a 1970 political drama film directed by Paul Williams. The screenplay was written by Hans Koning (credited as Hans Koningsberger), based on his novel of the same name. It was the film debut for actor Jeffrey Jones. <sep> Jeffrey Duncan Jones (born September 28, 1946) is an American actor best known for his roles as Edward R. Rooney in \"Ferris Bueller's Day Off\" (1986), Charles Deetz in \"Beetlejuice\" (1988), <ans> Skip Tyler <ans> in \"The Hunt for Red October\" (1990) and A.W. Merrick in \"Deadwood\" (2004–2006). His career started in Guthrie Theater in Minneapolis, Minnesota, advanced to London and Broadway, before leading to a series of character acting roles in film and television, which often capitalized on Jones's deadpan delivery of characters in unusual situations to comic effect. Jones was nominated for a Golden Globe Award for his portrayal of Joseph II in \"Amadeus\" (1984) and a Screen Actors Guild Award as part of the ensemble cast of \"Deadwood\".","refq":"Which character in The Hunt for Red October was played by the actor who made his film debut in The Revolutionary","1hop_q":"Who played the role of Skip Tyler in \"The Hunt for Red October\"?","non_q":"\"The Revolutionary was the film debut for actor Jeffrey Jones in his character in The Hunt for Red October.\"","random_q":"Where was the castle at which Governor of Chester placed a garrison?","annoq":"What role did the actor who made their film debut in \"The Revolutionary\" play in \"The Hunt for Red October\"?","annoq_clue_refq":"What character did the actor that made their film debut in \"The Revolutionary\" play in \"The Hunt for Red October\"?"}
{"og_id":"5a81d59a55429903bc27b9d6","contexts_w_ans":"The Tsavo Man-Eaters were a pair of man-eating Tsavo lions responsible for the deaths of a number of construction workers on the Kenya-Uganda Railway from March through December 1898. The significance of this pair of lions was their unusual behavior, such as the number of men killed and the manner of the attacks. <sep> The Tsavo lion (\"Panthera leo melanochaita\") is a lion population in the <ans> Tsavo East National Park <ans>, Kenya.","refq":"Tsavo Man-Eaters were found at what Kenyan reserve?","1hop_q":"What is the name of the national park where the Tsavo lion population is located?","non_q":"The Tsavo Man-Eaters were notorious for their attacks on construction workers along the Kenya-Uganda Railway.","random_q":"Angela Rayner, Britain's current shadow Secretary of State for Education, is an MP for which party?","annoq":"Which park in Kenya is home to the animals responsible for the deaths of many construction workers in 1898?","annoq_clue_refq":"Where do Tsavo Man-Eaters live?"}
{"og_id":"5a79102a554299148911f9da","contexts_w_ans":"Las Vegas Stadium is the working name for a domed stadium under construction in Paradise, Nevada for the Las Vegas Raiders of the National Football League (NFL) and the UNLV Rebels football team from the <ans> University of Nevada, Las Vegas <ans> (UNLV). It is located on about 62 acres west of Mandalay Bay at Russell Road and Hacienda Avenue and between Polaris Avenue and Dean Martin Drive, just west of Interstate 15. Construction of the $1.9 billion stadium began in September 2017 and is expected to be completed in time for the 2020 NFL season. <sep> The Oakland Raiders relocation to Las Vegas was a successful effort by the owner of the Oakland Raiders (Mark Davis) to relocate the American football club from its current and longtime home of Oakland, California to Las Vegas, Nevada. The team is scheduled to begin play as the Las Vegas Raiders for the 2020 National Football League (NFL) season (although a move to Las Vegas could happen as soon as 2019 with Sam Boyd Stadium), playing home games at the Las Vegas Stadium. NFL team owners voted 31–1 to approve the move, which was announced at the annual league meetings in Phoenix, Arizona on March 27, 2017. The Raiders became the third NFL franchise to relocate in the 2010s, following the Rams' move from St. Louis, Missouri to Los Angeles, California on January 12, 2016, and the Chargers' move from San Diego, California to Los Angeles on January 12, 2017. The Raiders' move to Las Vegas comes after years of failed efforts to renovate or replace the Oakland–Alameda County Coliseum, which has been rated by multiple sources as one of the worst stadiums in the NFL.","refq":"This team which is moving from Oakland, California to Las Vegas Nevada with share its stadium with what college?","1hop_q":"Which university's football team will be playing at the Las Vegas Stadium?","non_q":"The Las Vegas stadium in Nevada will be the new home for the Oakland Raiders team.","random_q":"Where did Auguste von Müller play Dalila in 1877?","annoq":"Which university is expected to share a domed stadium with the Oakland Raiders after their relocation to Las Vegas?","annoq_clue_refq":"Which university is expected to share the Las Vegas Stadium with a team relocated from Oakland, California?"}
{"og_id":"5ab46d195542991751b4d76a","contexts_w_ans":"Whistl, formerly TNT Post UK, is a postal delivery company operating in the United Kingdom. The company primarily competes with UK Mail, UPS, Parcelforce, DHL, Hermes, Royal Mail and Yodel. It processes about 25% of the UK's mail, amounting to over 4 billion items per year in 2015. <sep> Yodel is a <ans> delivery service company <ans> in the United Kingdom and is one of the largest couriers along with Royal Mail. It was originally known as the Home Delivery Network until it acquired the B2B and B2C operations of DHL Express UK and thereafter, re-branded itself as Yodel in May 2010. It is privately owned by the billionaire Barclay Brothers.","refq":"Whistle and Yodel both specialize in what service?","1hop_q":"What is Yodel?","non_q":"Whistl and Yodel are delivery service companies operating in the United Kingdom.","random_q":"What date was the first live concert of the band co-founded by the woman who won Female Performer of the Year at the 2008 AVN Awards?","annoq":"Among Whistl's competitors, what type company is the one owned by the Barclay Brothers?","annoq_clue_refq":"What type of service do Whistl and Yodel provide?"}
{"og_id":"5ae4d3a55542990ba0bbb164","contexts_w_ans":"Bigfoot (also known as Sasquatch) is a cryptid which supposedly is a simian-like creature of American folklore that is said to inhabit forests, especially in the Pacific Northwest. Bigfoot is usually described as a large, hairy, bipedal humanoid. The term \"sasquatch\" is an Anglicized derivative of the Halkomelem word \"sásq'ets\". <sep> The <ans> Dewey Lake Monster <ans> is the name given to a large bipedal creature approximately 10 feet (3 meters) tall and weighing about 500 pounds (227 kilograms), which first gained wide notoriety in June 1964 after several reported sightings near Dewey Lake in Dowagiac, Michigan. It is also referred to as the Michigan Bigfoot and Sister Lakes Sasquatch.","refq":"What creature of American folklore gained notoriety in 1964?","1hop_q":"What is the name given to a large bipedal creature approximately 10 feet tall and weighing about 500 pounds, which first gained wide notoriety in June 1964 after several reported sightings near Dewey Lake in Dowagiac, Michigan?","non_q":"The American creature gained notoriety in 1964, becoming a legend in the folklore.","random_q":"Saratoga Springs is a train station owned by a public benefit corporation that runs the day-to-day management of what other Amtrak station in the Capital region?","annoq":"What is the name of the simian-like creature that allegedly appeared near Dewey Lake in Michigan?","annoq_clue_refq":"Which creature of American folklore gained notoriety in 1964?"}
{"og_id":"5a886211554299206df2b24a","contexts_w_ans":"Tonka is a <ans> 1958 Walt Disney Western adventure film <ans> about the US cavalry horse that survived the Battle of the Little Big Horn. Also released under the title A Horse Named Comanche, it stars Sal Mineo as a Sioux who fought there. It was filmed in Bend, Oregon, and distributed by Buena Vista Distribution. <sep> 101 Dalmatians is a 1996 American live-action comedy adventure film based on Walt Disney's animated 1961 movie adaptation of Dodie Smith's 1956 novel \"The Hundred and One Dalmatians.\" Directed by Stephen Herek and co-produced by John Hughes and Ricardo Mestres, it stars Glenn Close, Jeff Daniels, Joely Richardson, Joan Plowright, Hugh Laurie, Mark Williams and Tim McInnerny. In contrast with the 1961 film, none of the animals talk in this version. Released on November 27, 1996 by Walt Disney Pictures, the film was praised for its faithfulness to the animated classic. It received mixed reviews, but was a commercial success, grossing $320.6 million in theaters against a $75 million budget. Close, who was universally praised for her portrayal as Cruella de Vil, was nominated for a Golden Globe for Best Performance by an Actress in a Motion Picture - Comedy or Musical, but lost to Madonna in \"Evita\". The film was also nominated for a BAFTA award for best makeup effects. A theatrical sequel titled \"102 Dalmatians\" was released on November 22, 2000 with Close and McInnerny reprising their roles.","refq":"Were the films Tonka and 101 Dalmatians released in the same decade?","1hop_q":"What is Tonka?","non_q":"The film \"Tonka\" was released and filmed, as well as \"101 Dalmatians\".","random_q":"The Bad Beginning is the first novel of a chirldren's novel series by a writer born in which year ?","annoq":"What type of movie is Tonka, a 1958 Walt Disney Western adventure film or a 1996 American live-action comedy adventure film?","annoq_clue_refq":"What type of movie is Tonka, a 1958 Walt Disney Western adventure film or a 1996 American live-action comedy adventure film?"}
{"og_id":"5abbda84554299642a094b5b","contexts_w_ans":"The Saab JAS 39 Gripen (English: \"griffin\" ) is a light single-engine multirole fighter aircraft manufactured by the Swedish aerospace company Saab. It was designed to replace the Saab 35 Draken and 37 Viggen in the Swedish Air Force (\"Flygvapnet\"). The Gripen has a delta wing and canard configuration with relaxed stability design and fly-by-wire flight controls. It is powered by the Volvo RM1<ans> 2 <ans>, and has a top speed of Mach <ans> 2 <ans>. Later aircraft are modified for NATO interoperability standards and to undertake in-flight refuelling. <sep> In fluid dynamics, the Mach number (M or Ma) ( ; ] ) is a dimensionless quantity representing the ratio of flow velocity past a boundary to the local speed of sound.","refq":"What is the ratio of flow velocity past a boundary to the local speed of sound for a Saab JAS 39 Gripen?","1hop_q":"What is the top speed of the Gripen aircraft?","non_q":"The Saab JAS 39 Gripen has a top speed of Mach 2, exceeding the local sound boundary.","random_q":"Who managed production of the first single of imagine dragons’ band ? Answer: Brandon Darner","annoq":"What is the Gripen's top speed in terms of Mach number?","annoq_clue_refq":"What is the Saab JAS 39 Gripen's top speed in terms of quantity representing the ratio of flow velocity past a boundary to the local speed of sound?"}
{"og_id":"5ae0f6f5554299422ee99583","contexts_w_ans":"\"I've Been Working\" is a song written by Northern Irish singer-songwriter Van Morrison appearing on the album \"His Band and the Street Choir\", released in 1970. The song was first an outtake from Morrison's well received album \"Astral Weeks\" of 1968. Other versions of \"I've Been Working\" were recorded for Morrison's next album \"Moondance\", of which, three were released on the 2013 deluxe edition. <sep> His Band and the Street Choir (also referred to as \"Street Choir\") is the fourth studio album by Northern Irish singer-songwriter Van Morrison. It was released on 15 November 1970 by <ans> Warner Bros <ans>. Records. Originally titled \"Virgo's Fool\", \"Street Choir\" was renamed by <ans> Warner Bros <ans>. without Morrison's consent. Recording began in early 1970 with a demo session in a small church in Woodstock, New York. Morrison booked the A&R Studios on 46th Street in New York City in the second quarter of 1970 to produce two sessions of songs that were released on \"His Band and the Street Choir\".","refq":"Which record label released Van Morrison's \"I've Been Working\" on the album \"His Band and the Street Choir\"?","1hop_q":"Who renamed the album \"Street Choir\" without Morrison's consent?","non_q":"Van Morrison recorded the album \"His Band and the Street Choir\" which was released.","random_q":"Which footballer was substituted for by Dave McEwen and is the eighth highest scorer in the Premier League?","annoq":"Which company released Van Morrison's album featuring the song \"I've Been Working\"?","annoq_clue_refq":"Which record company released Van Morrison's album His Band and the Street Choir, which features the song \"I've Been Working\"?"}
{"og_id":"5a8b7e9c5542995d1e6f13c1","contexts_w_ans":"Psychopsis, abbreviated Psychp in horticultural trade, is a genus of 5 known species of orchids native to northern South America, Central America and Trinidad. It was formerly included in the massively paraphyletic \"wastebin genus\" \"Oncidium\". The genus as a whole is commonly called butterfly orchids, but some species of other orchid genera are also called thus. <sep> Aubrieta (commonly known as Aubretia) is a genus of about 12 species of <ans> flowering plants <ans> in the cabbage family Brassicaceae. The genus is named after Claude Aubriet, a French flower-painter. It originates from southern Europe east to central Asia but is now a common garden escape throughout Europe. It is a low, spreading plant, hardy, evergreen and perennial, with small violet, pink or white flowers, and inhabits rocks and banks. It prefers light, well-drained soil, is tolerant of a wide pH range, and can grow in partial shade or full sun.","refq":"Psychopsis and Aubrieta are both genuses of which type of plants?","1hop_q":"What type of plants are Aubrieta?","non_q":"Psychopsis and Aubrieta are two genuses of plants commonly referred to as butterfly orchids.","random_q":"Who is best known for his work in alternate history, John Irving or Harry Turtledove?","annoq":"What type of plants are included in Aubrieta, orchids or flowering plants?","annoq_clue_refq":"What type of plants are included in Aubrieta but not Psychopsis?"}
{"og_id":"5a8351fd55429954d2e2ec98","contexts_w_ans":"Journey into Mystery is an American comic book series initially published by Atlas Comics, then by its successor, Marvel Comics. Initially a horror comics anthology, it segued to giant-monster and science fiction stories in the late 1950s. Beginning with issue #83 (cover dated Aug. 1962), it ran the superhero feature \"The Mighty <ans> Thor <ans>\", created by writers Stan Lee and Larry Lieber and artist Jack Kirby, and inspired by the mythological Norse thunder god. The series, which was renamed for its superhero star with issue #126 (March 1966), has been revived three times: in the 1970s as a horror anthology, and in the 1990s and 2010s with characters from Marvel's <ans> Thor <ans> mythos. <sep> Asgard is the name of a fictional realm and its capital city appearing in American comic books published by Marvel Comics. Based on the realm of the same name from Norse mythology, Asgard is home to the Asgardians and other beings adapted from Norse mythology. Asgard first appeared in \"Journey into Mystery\" #83 (October 1962) by Stan Lee, Larry Lieber and Jack Kirby, and features prominently in stories that follow the Marvel Comics superhero, <ans> Thor <ans>.","refq":"What superhero is followed in the American comic book series that started as a horror comics anthology and introduced the fictional realm based on Norse mythology?","1hop_q":"Who is the superhero star of the series?","non_q":"Asgard is a fictional realm based on Norse mythology that appears in Marvel Comics.","random_q":"A Life for the Tsar is a  Russian libretto with four acts, Tosca an Italian libretto has how many acts?","annoq":"Asgard is a fictional realm that is home to which comic character inspired by the mythological Norse thunder god?","annoq_clue_refq":"The fictional realm based on Norse mythology, featured in an American horror comics anthology, follows which superhero?"}
{"og_id":"5ab6266555429953192ad277","contexts_w_ans":"Ashes in the Snow is a World War II drama based on the best-seller \"Between Shades of Gray\" by Ruta Sepetys. <sep> Between Shades of Gray, a New York Times Bestseller, is the debut novel of American novelist Ruta Sepetys. It follows the Stalinist repressions of the mid-20th century and follows the life of Lina as she is deported from her native Lithuania with her mother and younger brother and the journey they take to a labor-camp in Siberia. It was nominated for the 2012 CILIP Carnegie Medal and has been translated into more than <ans> 27 languages <ans>.","refq":"Ashes in the Snow is a World War II drama based on a best-seller novel that was translated to how many languages ?","1hop_q":"How many languages has \"Between Shades of Gray\" been translated into?","non_q":"Ashes in the Snow is a World War II drama based on the best-selling novel translated into many languages.","random_q":"Have Abbas Kiarostami and Stuart Baird both produced films?","annoq":"Into how many languages has the novel that inspired the production of \"Ashes in the Snow\" been translated?","annoq_clue_refq":"How many languages has the novel that the World War II drama \"Ashes in the Snow\" is based on been translated into?"}
{"og_id":"5adc6ca85542994650320ce1","contexts_w_ans":"The 1998–99 NBA season was the Lakers' 51st season in the National Basketball Association, and 39th in the city of Los Angeles. It was the Lakers' final season at the Great Western Forum. During the offseason, the Lakers signed free agent Derek Harper. In his first season as a starter, Kobe Bryant finished second on the team in scoring with 19.9 points per game. At midseason, Eddie Jones and Elden Campbell were both traded to the Charlotte Hornets for All-Star forward Glen Rice, J.R. Reid and B.J. Armstrong, who was released and signed with the Orlando Magic. The Lakers move continued midway through the season, signing free agent and rebounding specialist Dennis Rodman, who was well known for winning championships with the Detroit Pistons and the Chicago Bulls. However, after 23 games, Rodman was released by the team. <sep> Dennis Keith Rodman (born May 13, 1961) is an American retired professional basketball player, who played for the Detroit Pistons, San Antonio Spurs, Chicago Bulls, Los Angeles Lakers, and Dallas Mavericks in the National Basketball Association (NBA). He was nicknamed \"<ans> The Worm <ans>\" and was known for his fierce defensive and rebounding abilities.","refq":"The 1998–99 Los Angeles Lakers season included the signing of the rebounding specialist who had what nickname?","1hop_q":"What was Dennis Keith Rodman's nickname?","non_q":"During the 1998–99 season, the Los Angeles Lakers signed rebounding specialist Dennis Rodman.","random_q":"Where is the headquarters of the video game publisher that is owned by the same company that owns the \"Quake\" series?","annoq":"What was the nickname of the free agent that was signed by the Lakers in the 1998-99 NBA season?","annoq_clue_refq":"What was the nickname of the rebounding specialist that was signed by the Los Angeles Lakers in the 1998-99 season?"}
{"og_id":"5a8b46925542995d1e6f133c","contexts_w_ans":"\"Miss Emily's Picture\" is a song written by Red Lane, and recorded by American country music artist John Conlee. It was released in August 1981 as the second single from the album \"With Love\". The song reached #2 on the \"Billboard\" Hot Country Singles & Tracks chart. <sep> John Conlee (born <ans> August 11, 1946 <ans>) is an American country music singer. Between 1978 and 2004 Conlee charted a total of 32 singles on the \"Billboard\" Hot Country Songs charts, and recorded 11 studio albums. His singles include seven #1 hits: \"Lady Lay Down,\" \"Backside of Thirty,\" \"Common Man,\" \"I'm Only in It for the Love,\" \"In My Eyes,\" \"As Long As I'm Rockin' with You\" and \"Got My Heart Set on You.\" In addition to these, Conlee sent 14 other songs into the Top Ten.","refq":"When was the singer of Miss Emily's Picture born?","1hop_q":"When was John Conlee born?","non_q":"Miss Emily's Picture was recorded by American country music singer John Conlee.","random_q":"What is the origin of the conductor of Where are You, my Brothers?","annoq":"When was the artist of the song \"Miss Emily's Picture\" born?","annoq_clue_refq":"When was the singer of the song \"Miss Emily's Picture\" born?"}
{"og_id":"5a7f57a45542992097ad2f29","contexts_w_ans":"Johan Henrik Deuntzer (20 May 1845 – 16 November 1918) was a Danish politician, member of the <ans> Liberal \"Venstre\" party <ans> until 1905 where he joined the Danish Social Liberal Party. He was Council President and Foreign Minister of Denmark from 1901 to 1905 as the leader of the Cabinet of Deuntzer. <sep> The Danish Social Liberal Party (Danish: \"Radikale Venstre\" , \"Radical Left\", i.e. \"Radical Liberal Party\") is a social-liberal political party in Denmark. The party is a member of Liberal International and the Alliance of Liberals and Democrats for Europe (ALDE).","refq":"What party was Johan Henrik Deuntzer a part of before the party that translates to the \"Radical Left?\"","1hop_q":"What party was Johan Henrik Deuntzer a member of until 1905?","non_q":"Johan Henrik Deuntzer was a member of the party called the Radical Left Party.","random_q":"In which city is this historically black university located where Ron Dickerson served as the head football coach from 1998 through 1999?","annoq":"Which party was Johan Henrik Deuntzer a member of before joining the so-called Radikale Venstre?","annoq_clue_refq":"Which party was Johan Henrik Deuntzer a part of before joining the so-called Radical Left?"}
{"og_id":"5a8cfee555429941ae14df5c","contexts_w_ans":"Elephants are large mammals of the family Elephantidae and the order Proboscidea. Three species are currently recognized: the African bush elephant (\"Loxodonta africana\"), the African forest elephant (\"L. cyclotis\"), and the Asian elephant (\"Elephas maximus\"). Elephants are scattered throughout sub-Saharan Africa, South Asia, and Southeast Asia. Elephantidae is the only surviving family of the order Proboscidea; other, now extinct, members of the order include deinotheres, gomphotheres, mammoths, and mastodons. <sep> Gaja in <ans> Sanskrit <ans> means Elephant. 'Brishta' is the back portion of a sitting elephant. The later Cholas of the Chola empire in Indian subcontinent, especially the ones in the Thondai Mandalam around the North Tamil Nadu area constructed temples which had this vimanas.","refq":"How are elephants connected to Gajabrishta?","1hop_q":"What language does the word \"Gaja\" originate from?","non_q":"Elephants, the largest land mammals, are found in sub-Saharan Africa, South Asia, and Southeast Asia.","random_q":"What 19th century African-American piano player has had his music revived by John Davis?","annoq":"In which language does the term \"gaja\" refers to the animal belonging to the family Elephantidae?","annoq_clue_refq":"In which language does the term \"gaja\" refers to elephant?"}
{"og_id":"5ae446175542995ad6573d1f","contexts_w_ans":"Like many Twins teams of its half-decade, the 1998 Minnesota Twins neither impressed nor contended. The team finished with a 70-92 record, with subpar batting and pitching. The season was not without its bright spots, as individual players had solid seasons and Hall of Fame designated hitter Paul Molitor announced his retirement at the end of the season. Tom Kelly's team had plenty of lowlights, most notably <ans> David Wells <ans>' perfect game against the team on May 17 at Yankee Stadium. <sep> Paul Leo Molitor (born August 22, 1956), nicknamed \"Molly\" and \"The Ignitor\", is an American former Major League Baseball (MLB) player and current manager of the Minnesota Twins, who is in the Baseball Hall of Fame. During his 21-year baseball career, he played for the Milwaukee Brewers (1978–1992), Toronto Blue Jays (1993–1995), and Minnesota Twins (1996–1998). He was known for his exceptional hitting and speed. He made seven All-Star Game appearances and was the World Series MVP in 1993.","refq":"Who had a perfect game against The Ignitor's team in 1998?","1hop_q":"Who pitched a perfect game against the Minnesota Twins on May 17?","non_q":"In 1998, the Twins team experienced a low season, with notable highlights like David Wells' perfect game.","random_q":"What movie does Ed Skrein act in that is a french action film?","annoq":"Who had a perfect win against Tom Kelly's team in the same season in which \"The Ignitor\" announced his retirement?","annoq_clue_refq":"Who had a perfect game against The Ignitor's team in 1998?"}
{"og_id":"5ab797af5542995dae37e96c","contexts_w_ans":"Shin Hyun-joon (Hangul: 신현준 ; born October 28, 1968) is a South Korean actor. He is best known for his roles in \"Barefoot Ki-bong\", \"Stairway to Heaven\" and the \"Marrying the Mafia\" sequels, and as the photographer in the popular music video \"Because I'm A Girl\" by KISS. In the Korean press he is nicknamed as 아랍왕자 (\"Prince of Arab\") due to his foreign look and long eyelashes. <sep> Marrying the Mafia II is a <ans> 2005 <ans> South Korean film, the sequel to \"Marrying the Mafia\" (2002). It was the most successful comedy film in South Korea the year of its release; its over 5 million tickets sold represented more than 10% of the population and contributed to the third straight year that more tickets were sold for local than for Hollywood films.","refq":"In what year was Shin Hyun-joon in the successful South Korean comey sequel?","1hop_q":"What is the year of release of Marrying the Mafia II?","non_q":"Shin Hyun-joon was successful in the South Korean sequel, \"Marrying the Mafia II\" that year.","random_q":"What country is Jesse Stone: Lost in Paradise filmed in?","annoq":"When was the second part of the record-breaking sequels featuring Shin Hyun-joon released?","annoq_clue_refq":"What was the release year of the second part of the successful sequels featuring South Korean actor Shin Hyun-joon?"}
{"og_id":"5a7643675542994ccc918747","contexts_w_ans":"Stefan Ruzowitzky (born 25 December 1961) is an Austrian film director and screenwriter. <sep> <ans> David Ross Lederman <ans> (December 12, 1894 – August 24, 1972) was an American film director noted for his Western\/action\/adventure films of the 1930s and 1940s.","refq":"Who was born first D. Ross Lederman or Stefan Ruzowitzky?","1hop_q":"Who was an American film director noted for his Western\/action\/adventure films of the 1930s and 1940s?","non_q":"Stefan Ruzowitzky was a film director, while Ross Lederman was an American film director.","random_q":"Are Pitcher plant and Viola both carnivorous plants?","annoq":"Which director is American, David Ross Lederman or Stefan Ruzowitzky?","annoq_clue_refq":"Who was born earlier, Ross Lederman or Stefan Ruzowitzky?"}
{"og_id":"5a8e8d665542995085b3744e","contexts_w_ans":"Hwarang: The Poet Warrior Youth () is a South Korean television series starring Park Seo-joon, Go A-ra, and Park Hyung-sik. It evolves around an elite group of young men called \"Hwarang\" who discover their passions, love and friendship in the turmoil of the Silla Kingdom (57 B.C. - A.D. 935). The series aired every Monday and Tuesday at 22:00 (KST) on KBS2, from December 19, 2016 to February 21, 2017. <sep> Park Seo-joon (born <ans> Park Yong-gyu <ans>) is a South Korean actor. He is best known for his roles in the television dramas \"Kill Me, Heal Me\" (2015), \"She Was Pretty\" (2015), \"\" (2016-2017) and \"Fight for My Way\" (2017).","refq":"What was the birth name of the start of Hwarang: The Poet Warrior Youth?","1hop_q":"What is Park Seo-joon's birth name?","non_q":"\"Hwarang: The Poet Warrior Youth was a popular South Korean television series.\"","random_q":"What was the original name of the public airport 3 miles south of the central business district of Manchester?","annoq":"What was the birth name of the actor who starred in series like \"Hwarang: The Poet Warrior Youth\" and \"She Was Pretty\"?","annoq_clue_refq":"What was the birth name of the actor who starred in series like Hwarang: The Poet Warrior Youth?"}
{"og_id":"5ae4c01e55429913cc2044f3","contexts_w_ans":"Kieft's War, also known as the Wappinger War, was a conflict (1643–1645) between settlers of the nascent colony of New Netherland and the native Lenape population in what would later become the New York metropolitan area of the United States. It is named for Director-General of New Netherland Willem Kieft, who had ordered an attack without approval of his advisory council and against the wishes of the colonists. Dutch soldiers attacked Lenape camps and massacred the native inhabitants, which encouraged unification among the regional Algonquian tribes against the Dutch, and precipitated waves of attacks on both sides. This was one of the earliest conflicts between Native Americans and European settlers. Displeased with Kieft, the Dutch West India Company recalled him and he died while returning to the Netherlands. Peter Stuyvesant succeeded him in New Netherland. Because of the continuing threat by the Algonquians, numerous Dutch settlers returned to the Netherlands, and growth of the colony slowed. <sep> The Pound Ridge massacre was a battle of Kieft's War that took place in March 1644 between the forces of New Netherland and members of the Wappinger Confederacy at a Wappinger Confederacy village in the present-day town of Pound Ridge, New York. A mixed force of 130 Dutch and English soldiers led by <ans> Captain John Underhill <ans> launched a night attack on the village and destroyed it with fire. 500 to 700 members of the Wappinger Confederacy were killed while the New Netherland force lost one man killed and fifteen wounded. More casualties were suffered in this attack than in any other single incident in the war. Shortly after the battle several local Wappinger Confederacy sachems sued for peace.","refq":"Which Captain launched the attack which led to more casualties than any other incident in the war fought between the settlers of the nascent colony of New Netherland and the native Lenape population?","1hop_q":"Who led the mixed force of Dutch and English soldiers in the Pound Ridge massacre?","non_q":"During Kieft's War, settlers in the nascent New Netherland colony launched attacks on native Lenape populations.","random_q":"Sir Andrew Dudley commanded the English garrison of castle on the banks of what river?","annoq":"Who led the Pound Ridge massacre during the Wappinger War?","annoq_clue_refq":"Who led the deadliest attack during the war between the nascent colony of New Netherland and the native Lenape population?"}
{"og_id":"5ade157e55429939a52fe802","contexts_w_ans":"Jaroslav Kvapil (25 September 1868 in Chudenice, Kingdom of Bohemia – 10 January 1950 in Prague) was a Czech poet, playwright, and librettist. From 1900 he was a director and Dramaturg at the National Theatre in Prague, where he introduced plays by Anton Chekhov, Henrik Ibsen and Maxim Gorky into the repertory. Later he was a director at the Vinohrady Theatre (1921–1928). He wrote six plays, but is today chiefly remembered as the librettist of Antonín Dvořák's \"Rusalka\". <sep> The Kingdom of Bohemia, sometimes in English literature referred to as the <ans> Czech Kingdom <ans> (Czech: \"České království\" ; German: \"Königreich Böhmen\" ; Latin: \"Regnum Bohemiae\" , sometimes Latin: \"Regnum Czechorum\" ), was a medieval and early modern monarchy in Central Europe, the predecessor of the modern Czech Republic. It was an Imperial State in the Holy Roman Empire, and the Bohemian king was a prince-elector of the empire. The kings of Bohemia, besides Bohemia, ruled also the Lands of the Bohemian Crown, which at various times included Moravia, Silesia, Lusatia and parts of Saxony, Brandenburg and Bavaria.","refq":"Jaroslav Kvapil the Czech poet was born in the Kingdom of Bohemia, also referred to by what name?","1hop_q":"What is the English literary term for the Kingdom of Bohemia in some literature?","non_q":"Jaroslav Kvapil was a Czech poet who was referred to as the Kingdom of Bohemiae.","random_q":"What team did the star of the film Phase IV play in the NFL?","annoq":"What is another name used by English literature to refer to the monarchy into which Jaroslav Kvapil was born?","annoq_clue_refq":"The Kingdom of Bohemia, where Jaroslav Kvapil was born, is also referred to with which name?"}
{"og_id":"5a8cbda955429941ae14dee5","contexts_w_ans":"Martin Joseph O'Malley (born January 18, 1963) is an American politician and attorney who served as the 61st Governor of Maryland from 2007 to 2015. He previously served as the Mayor of Baltimore from <ans> 1999 to 2007 <ans>, and was a councilman from the Third Councilmanic District in the northeast section of the city on the Baltimore City Council from 1991 to 1999. <sep> Richard Burton is a Baltimore, Maryland, city council employee and runs the \"Believe\" campaign. He was a rapper before becoming involved in Martin O'Malley's first Mayoral campaign after meeting him in 1998.","refq":"Richard Burton became involved in a mayoral campaign for a politician that previously served as the Mayor of Baltimore during what time period?","1hop_q":"When did Martin O'Malley serve as the Mayor of Baltimore?","non_q":"Richard Burton, previously a rapper, became involved in Martin O'Malley's Mayoral campaign in 1998.","random_q":"When Kendall Dewan Marshall was drafted into the NBA, where was the drafting ceremony held?","annoq":"After his first Mayoral campaign with Richard Burton in 1998, how long did Martin O'Malley's serve as the Mayor of Baltimore?","annoq_clue_refq":"How long did the previous Mayor of Baltimore, whose campaign involved Richard Burton, hold the title?"}
{"og_id":"5a89432b554299669944a519","contexts_w_ans":"The Guadalcanal Campaign, also known as the Battle of Guadalcanal and codenamed <ans> Operation Watchtower <ans> was a military campaign fought between 7 August 1942 and 9 February 1943 on and around the island of Guadalcanal in the Pacific theater of World War II. It was the first major offensive by Allied forces against the Empire of Japan. <sep> Joseph Jacob \"Joe\" Foss (April 17, 1915 – January 1, 2003) was a United States Marine Corps major and the leading Marine fighter ace in World War II. He received the Medal of Honor in recognition of his role in air combat during the Guadalcanal Campaign.","refq":"What was the code name of the campaign where Joe Foss received a Medal of Honor?","1hop_q":"What was the codename for the Battle of Guadalcanal?","non_q":"Joe Foss received the Medal of Honor for his role in the Guadalcanal Campaign.","random_q":"Were both Dee Brown and Edwin Arlington Robinson American writers?","annoq":"What is the codename of the World War II military campaign in which Joe Foss received a medal for his role in air combat?","annoq_clue_refq":"What is the codename of the campaign in which Joe Foss received a Medal of Honor?"}
{"og_id":"5a729fa15542994cef4bc397","contexts_w_ans":"<ans> Bambi <ans> is a 1942 American animated film directed by David Hand (supervising a team of sequence directors), produced by Walt Disney and based on the book \"<ans> Bambi <ans>, a Life in the Woods\" by Austrian author Felix Salten. The film was released by RKO Radio Pictures on August 13, 1942, and is the fifth Disney animated feature film. <sep> Underdog is a 2007 American family superhero comedy film based on the 1960s cartoon series of the same name. Directed by Frederik Du Chau and written by Joe Piscatella, Adam Rifkin, and Craig A. Williams, the film stars Jim Belushi, Peter Dinklage, John Slattery, and Patrick Warburton with the voice talents of Jason Lee, Amy Adams, and Brad Garrett. Unlike the TV series, the Underdog character is portrayed as a regular dog rather than an anthropomorphic one. Underdog, voiced by Jason Lee, was played by a lemon beagle named Leo sporting a red sweater and a blue cape. The film grossed $65.3 million worldwide.","refq":"Which movie came out first, \"Bambi\" or \"Underdog\"?","1hop_q":"What is the name of the 1942 American animated film directed by David Hand and based on the book \"Bambi, a Life in the Woods\" by Austrian author Felix Salten?","non_q":"\"Bambi\" is an animated film, while \"Underdog\" is a family superhero comedy film.","random_q":"Tallinn Airport is a secondary hub for two airlines, one of which established in 1929. What airline is this?","annoq":"Which of the following films was released first: \"Bambi\" or \"Underdog\"?","annoq_clue_refq":"Which of the following films came out first: \"Bambi\" or \"Underdog\"?"}
{"og_id":"5a7da6cb5542990b8f5039ff","contexts_w_ans":"Safelight is a 2015 American drama film, written and directed by <ans> Tony Aloupis <ans>, and starring Juno Temple, Evan Peters, Kevin Alejandro, Jason Beghe, Ariel Winter, and Christine Lahti. The film had its world premiere on April 17, 2015 at the Nashville Film Festival. <sep> Kevin Michael Alejandro (born April 7, 1976) is an American actor.","refq":"Kevin Alejandro was part of the cast of the 2015 American drama film written and directed by whom?","1hop_q":"Who wrote and directed the film Safelight?","non_q":"Kevin Alejandro is an American actor in the 2015 drama film.","random_q":"Between Norman Lindsay and Rohinton Mistry, who was born earlier?","annoq":"Who is the director of the 2015 drama film starring Kevin Michael Alejandro?","annoq_clue_refq":"By whom was the 2015 American drama film starring Kevin Michael Alejandro written and directed?"}
{"og_id":"5a84564c5542990548d0b288","contexts_w_ans":"The Easybeats were an Australian rock band which formed in <ans> Sydney, Australia <ans>, in late 1964, and disbanded at the end of 1969. They were the antipodean echo to the style and sound of the Beatles in Britain, and the first rock and roll act from Australia to score an international pop hit with the 1966 single, \"Friday on My Mind\". <sep> \"Evie\" is an Australian rock song released as a single in 1974 by Australian singer and former frontman of The Easybeats, Stevie Wright. It was written by Harry Vanda and George Young. It has been suggested that it is the first 11-minute song to chart at #1 anywhere in the world.","refq":"What city was the band whose member released the song \"Evie\" formed in?","1hop_q":"Where did The Easybeats form as a rock band in 1964?","non_q":"\"The Easybeats was a band formed in Sydney, Australia, and Evie was a solo song released by the band's frontman\"","random_q":"How tall is the hill that the Freighter \"G-AICS\" crashed into in 1958?","annoq":"Where was the band that Stevie Wright was part of based? ","annoq_clue_refq":"Where was the band, whose member later released \"Evie\" as a solo artist, formed?"}
{"og_id":"5ae75a5a5542991bbc9761f3","contexts_w_ans":"\"Raabta\" (English: Relation) is a romantic Hindi song from the 2012 Bollywood film, \"<ans> Agent Vinod <ans>\". Composed by Pritam Chakraborty, the song is sung by Arijit Singh, with lyrics penned by Amitabh Bhattacharya. The music video of the track features actors Saif Ali Khan and Kareena Kapoor Khan, and the remix video of the song stars Deepika Padukone, Sushant Singh Rajput, Kriti Sanon and Jim Sarbh from the film Raabta . <sep> Kriti Sanon (born 27July 1990) is an Indian model and film actress who appears in Hindi and Telugu films. After beginning with modelling, she made her acting debut with Sukumar's Telugu psychological thriller film \"\". Her first Bollywood film was Sabbir Khan's romantic action drama \"Heropanti\", for which she won the Filmfare Award for Best Female Debut. In 2015, Sanon starred in the successful romantic action comedy \"Dilwale\".","refq":"\"Heropanti\" star Kriti Sanon appears in the remix video for a song from what Bollywood film?","1hop_q":"What is the name of the Bollywood film that the song \"Raabta\" is from?","non_q":"Kriti Sanon starred in the Bollywood film Heropanti and appears in songs and videos.","random_q":"Which opera Ernani and Stiffelio.has more acts ?","annoq":"Which 2012 Bollywood film featured an actress from the movie \"Heropanti\" in the music video of its remixed soundtrack?","annoq_clue_refq":"Kriti Sanon, appearing in films like \"Heropanti\" and \"Raabta\", starred in the soundtrack's music video of which 2012 Bollywood film?"}
{"og_id":"5a84524a554299123d8c2203","contexts_w_ans":"The Nyāya Sūtras is an ancient Indian Sanskrit text composed by Akṣapāda Gautama , and the foundational text of the Nyaya school of Hindu philosophy. The date when the text was composed, and the biography of its author is unknown, but variously estimated between 6th-century BCE and 2nd-century CE. The text may have been composed by more than one author, over a period of time. The text consists of <ans> five books <ans>, with two chapters in each book, with a cumulative total of 528 aphoristic sutras, about rules of reason, logic, epistemology and metaphysics. <sep> The development of Indian logic dates back to the \"anviksiki\" of Medhatithi Gautama (c. 7th century BCE) the Sanskrit grammar rules of Pāṇini (c. 5th century BCE); the Vaisheshika school's analysis of atomism (c. 2nd century BCE); the analysis of inference by Gotama (c. 2nd century), founder of the Nyaya school of Hindu philosophy; and the tetralemma of Nagarjuna (c. 2nd century CE). Indian logic stands as one of the three original traditions of logic, alongside the Greek and the Chinese logic. The Indian tradition continued to develop through to early modern times, in the form of the Navya-Nyāya school of logic.","refq":"How many books are in the text composed by the founder Nyaya school of Hindu philosophy and is used in the development of Indian logic?","1hop_q":"How many books does the Nyāya Sūtras consist of?","non_q":"\"The Indian text Nyaya Sutras was composed by the founder of Nyaya school of Hindu philosophy.\"","random_q":"Chili Con Carnage and Total Overdose are games both developed by which company?","annoq":"How many books does the foundational text that gave rise to the analysis of inference shaping the development of Indian logic consist of?","annoq_clue_refq":"How many books does the text, composed by the founder of the Nyaya school of Hindu philosophy and shaping the development of Indian logic, include?"}
{"og_id":"5a84c89a5542992a431d1a9c","contexts_w_ans":"The Forest of Bowland, also known as the Bowland Fells, is an area of barren gritstone fells, deep valleys and peat moorland, mostly in north-east Lancashire, England with a small part in North Yorkshire (before 1974, some of the area was in the West Riding of Yorkshire). It was once described as the <ans> \"Switzerland of England\" <ans>. <sep> Oakenclough ( ) is an English hamlet located on the edge of the Forest of Bowland in Lancashire.","refq":"What is another name for a forest which has the hamlet of Oakenclough on the edge of it?","1hop_q":"What was the Forest of Bowland once described as?","non_q":"Oakenclough is a hamlet located on the edge of the Forest of Bowland.","random_q":"Miracle is a song by Julian Perretta, that was a collaboration with what Belgian DJ and record producer that is best known for \"Are you with me\" and \"Reality\"?","annoq":"What term was used to describe the area located near Oakenclough?","annoq_clue_refq":"What term was used to refer to the forest on the edge of which Oakenclough is located?"}
{"og_id":"5a7d119d5542995ed0d165d5","contexts_w_ans":"<ans> Florence Leontine Mary Welch <ans> (born 28 August 1986) is an English musician, singer and songwriter, best known as the vocalist of indie rock band Florence and the Machine. <sep> Gunnar Eric Nelson (born September 20, 1967) is an American musician, singer, and songwriter and international multi-platinum recording artist.","refq":"Who was born more recently, Gunnar Nelson or Florence Welch?","1hop_q":"What is the full name of the vocalist of Florence and the Machine?","non_q":"Florence Welch was born more recently than Gunnar Nelson.","random_q":"Were both James Cagney and Cy Endfield magicians?","annoq":"Which artist was born later: Florence Leontine Mary Welch or  Gunnar Eric Nelson?","annoq_clue_refq":"Which artist was born later: Florence Welch or  Gunnar Nelson?"}
{"og_id":"5a7dc3275542997cc2c4749c","contexts_w_ans":"The UNLV Rebels football program is a college football team that represents the University of Nevada, Las Vegas (UNLV). The team is currently a member of the Mountain West Conference, which is a Division I Bowl Subdivision (formerly Division I-A) conference of the National Collegiate Athletics Association (NCAA). The program which began on September 14, 1968, is coached by former Bishop Gorman High School head coach, Tony Sanchez. The team's home games are played at <ans> Sam Boyd Stadium <ans> in Whitney, Nevada. <sep> Kent Lex Baer (born May 2, 1951) is an American college football coach. He is the defensive coordinator for UNLV Rebels.","refq":"What stadium does the team who has Kent Baer as the defensive coordinator play its home games?","1hop_q":"In which stadium are the UNLV Rebels' home games played?","non_q":"Kent Baer is the defensive coordinator for UNLV Rebels, whose home games are played at Sam Boyd Stadium.","random_q":"What is the name of the American artist who was part of a duo that mainly painted on the streets of downtown Manhattan?","annoq":"In which stadium does the football team, for which Kent Baer is the defensive coordinator, host its home games?","annoq_clue_refq":"In which stadium does the team, for which Kent Baer is the defensive coordinator, host its home games?"}
{"og_id":"5a879adb5542996e4f30887f","contexts_w_ans":"The Democracy Is Strengthened by Casting Light On Spending in Elections Act, commonly known as the DISCLOSE Act and also known as H.R. 5175 (S.3628-Senate), was a bill introduced in the U.S. House of Representatives by Chris Van Hollen (D-Maryland) on April 29, 2010 and in the U.S. Senate by Charles Schumer (D-New York) on July 21, 2010. <sep> Christopher Van Hollen Jr. (born January 10, 1959) is the junior <ans> United States Senator <ans> from Maryland, serving since January 3, 2017. From 2003 to 2017, he served as the U.S. Representative for Maryland 's 8 congressional district . He is a member of the Democratic Party.","refq":"What other political position did the person who introduced the DISCLOSE Act hold?","1hop_q":"What position has Christopher Van Hollen Jr. held since 2017?","non_q":"\"The DISCLOSE Act was introduced in 2010 to strengthen democracy by casting light on spending.\"","random_q":"Were the films Amy and 20,000 Leagues Under the Sea directed by the same person?","annoq":"Since 2017, what position has the U.S. Representative who introduced the DISCLOSE Act held?","annoq_clue_refq":"What is the most recent position held by the politician who introduced the DISCLOSE Act?"}
{"og_id":"5a7f6fd75542992e7d278cfa","contexts_w_ans":"Neil Ellwood Peart, {'1': \", '2': \", '3': \", '4': \"} ( ; born September 12, 1952), is a Canadian-American musician and author, best known as the drummer and primary lyricist for the rock band <ans> Rush <ans>. Peart has received numerous awards for his musical performances, including an induction into the \"Modern Drummer\" Hall of Fame in 1983, making him the youngest person ever so honored. He is known for his technical proficiency and stamina. <sep> \"Nobody's Hero\" is a song by Canadian progressive rock band <ans> Rush <ans>, released as the third single from their 1993 album \"Counterparts\". The first stanza deals with the AIDS-related death of a homosexual man named Ellis, a friend of Neil Peart when Peart lived in London. After the chorus, the second stanza speaks of a girl who was murdered in Peart's hometown, Port Dalhousie. The girl is rumoured to have been Kristen French, one of Paul Bernardo's victims.","refq":"Which Canadian rock band released an album called \"Counterparts\" and had a drummer who was inducted into the Modern Drummer Hall of Fame?","1hop_q":"What is the name of the rock band for which Neil Peart is best known as the drummer and primary lyricist?","non_q":"Neil Peart, a Canadian drummer, was inducted into the Modern Drummer Hall of Fame.","random_q":"Hip Hop Connection was considered the best magazine in the world by which rapper and author?","annoq":"Which rock band released a 1993 song about the deaths of the people connected to its drummer and primary lyricist?","annoq_clue_refq":"Which Canadian rock band, whose drummer was inducted into the 'Modern Drummer' Hall of Fame, released the album 'Counterparts'?\""}
{"og_id":"5ae679ec5542996d980e7b75","contexts_w_ans":"Carlos Vieco Ortiz (March 4, 1900 - September 13, 1979) was an award winning musician and composer from Medellín, Colombia. The open air theater on Nutibara Hill in Medellín is named after him. <sep> Medellín (] ), officially the Municipality of Medellín (Spanish: \"Municipio de Medellín\" ), is the second-largest city in Colombia and the capital of the department of Antioquia. It is located in the Aburrá Valley, a central region of the Andes Mountains in South America. According to the National Administrative Department of Statistics, the city has an estimated population of 2.5 million as of 2017 . With its surrounding area that includes nine other cities, the metropolitan area of Medellín is the second-largest urban agglomeration in Colombia in terms of population and economy, with more than <ans> 3.7 million <ans> people.","refq":"What is the population of the metropolitan area in Colombia where Carlos Vieco Ortiz was born?","1hop_q":"What is the population of the metropolitan area of Medellín including its surrounding area?","non_q":"Carlos Vieco Ortiz was a musician and composer from Medellín, Colombia, a city with a large population.","random_q":"Who is the actress that is the lead role in ImageMovers' first released movie?","annoq":"What is the population size of the metropolitan area where Carlos Ortiz is from?","annoq_clue_refq":"What is the population size of the metropolitan area where Carlos Vieco Ortiz is from?"}
{"og_id":"5ab4147a5542996a3a969f1e","contexts_w_ans":"Informally, the 50–40–90 club is the group of National Basketball Association (NBA) players who have had a shooting percentage at or above 50% for field goals, 40% for three-pointers, and 90% for free throws during an entire NBA regular season while also achieving the NBA minimum number of makes in each category. Only <ans> seven <ans> players have had 50–40–90 seasons. <sep> Wardell Stephen Curry II (born March 14, 1988) is an American professional basketball player for the Golden State Warriors of the National Basketball Association (NBA). Many players and analysts have called him the greatest shooter in NBA history. In 2014–15, Curry won the NBA Most Valuable Player Award and led the Warriors to their first championship since 1975. The following season, he became the first player in NBA history to be elected MVP by a unanimous vote and to lead the league in scoring while shooting above 50–40–90. That same year, the Warriors broke the record for the most wins in an NBA season. Curry helped the Warriors return to the NBA Finals for a third straight year in 2017, where he won his second NBA championship.","refq":"How many players are in the club in which Stephen Curry became part of in the 2015-2016 NBA season?","1hop_q":"How many players have had 50–40–90 seasons in the NBA?","non_q":"Stephen Curry became the first NBA player to achieve a 50–40–90 season.","random_q":"Which person associated with \"The Evil Eye\" film is in the National Jewish Sports Hall of Fame?","annoq":"How many basketball players, including Wardell Stephen Curry  II, have had 50-40-90 seasons?","annoq_clue_refq":"How many NBA players, including Stephen Curry, became a member of the 50-40-90 club?"}
{"og_id":"5a79332555429907847277e7","contexts_w_ans":"<ans> Juan Carlos Onetti <ans> Borges (July 1, 1909, Montevideo – May 30, 1994, Madrid) was an Uruguayan novelist and author of short stories. <sep> Bryce Courtenay, AM (14 August 193322 November 2012) was a South African\/Australian advertising director and novelist. He is one of Australia's best-selling authors, notable for his book \"The Power of One\".","refq":"Who died first, Bryce Courtenay or Juan Carlos Onetti?","1hop_q":"What is the name of the Uruguayan novelist born on July 1, 1909?","non_q":"\"Juan Carlos Onetti was a novelist, while Bryce Courtenay was an advertising director.\"","random_q":"Which Japanese-born American cinematogrpher is known for his photography in the 2009 supernatural horror film Jennifer's Body?","annoq":"Which novelist was born earlier: Bryce Courtenay or Juan Carlos Onetti?","annoq_clue_refq":"Who was born earlier: Bryce Courtenay or Juan Carlos Onetti?"}
{"og_id":"5ae1465855429920d5234373","contexts_w_ans":"Berk Communication and Marketing Group is an American public relations firm. The company is best known for representing D'usse Cognac, Kevin Durant, Robinson Canó, CC Sabathia, Roc Nation Sports, Tao Group, Tidal and Alex Rodriguez. Berk was founded in 1999. Britney Spears hired Berk Communications in 2002 to promote Nyla, Spears' restaurant in Manhattan's Dylan Hotel. In October 2015, MWW, a public relations firm headquartered in New York, acquired a majority stake in Berk. The company operates as an independent subsidiary acquisition and has expanded across the United States and Europe. Ron Berkowitz is the company's President and CEO. In February 2016, Berk signed with The Statler Hotel & Residences as public relations support through the hotel's relaunch. When baseball player Alex Rodriguez announced his retirement in 2016, it was also announced that Berk Communications would continue to work with Rodriguez. Rodriguez first signed with Berk in 2013. <sep> Carsten Charles \"CC\" Sabathia, Jr. (born July 21, 1980) is an American professional baseball pitcher for the <ans> New York Yankees <ans>.","refq":"Berk Communication and Marketing Group  best known for representing an American professional baseball pitcher for what team?","1hop_q":"Which team does Carsten Charles \"CC\" Sabathia, Jr. play for in professional baseball?","non_q":"Berk Communication and Marketing Group is best known for representing American professional baseball pitcher, CC Sabathia.","random_q":"I Love Rock 'n' Roll was originally relased by Allan Merrill of the Arrow, but was later released by what American singer and occasional actress?","annoq":"Berk is known to represent the pitcher born in 1980 for which baseball team?","annoq_clue_refq":"Berk Communication and Marketing Group is best known for representing an American professional pitcher from which baseball team?"}
{"og_id":"5ae1fbf05542997f29b3c1e7","contexts_w_ans":"The Sports Car Club of America (SCCA) is an American automobile club and sanctioning body supporting road racing, rallying, and autocross in the United States. Formed in <ans> 1944 <ans>, it runs many programs for both amateur and professional racers. <sep> The 2014 Trans-Am Series was the 46th running of the Sports Car Club of America's Trans-Am Series. It began March 2, 2014. The series featured TA, TA2, and TA3 groups, with TA3 split into two sub-groups. TA3-International was for select cars meeting SCCA GT-2 class rules, while TA3-American Muscle was for current-generation \"pony cars\" meeting NASA's American Iron class specifications.","refq":"When was the American automobile club which has 2014 Trans-Am Series as the 46th running of the Sports formed?","1hop_q":"When was the Sports Car Club of America (SCCA) formed?","non_q":"\"The Sports Car Club of America's Trans-Am Series held its 46th running in 2014.\"","random_q":"The Lake Koocanusa Scenic Byway begins in what county?","annoq":"When was the organization that hosts the Trans-Am series formed?","annoq_clue_refq":"When was the American automobile club that runs the 46th Trans-Am Series in 2014 formed?"}
{"og_id":"5ac31066554299741d48a19d","contexts_w_ans":"The St Kilda Football Club, nicknamed the Saints, is an Australian rules football club based in <ans> Melbourne <ans>, Victoria, Australia. The club plays in the Australian Football League, the sport's premier league. <sep> Jack Alfred Evans (born 11 October 1930) was an Australian rules footballer who played with St Kilda in the Victorian Football League (VFL).","refq":"Jack Alfred Evans played with a football club team that is based in what city in Australia?","1hop_q":"In which city in Australia is the St Kilda Football Club based?","non_q":"Jack Alfred Evans played football for St Kilda, a club based in Australia.","random_q":"Sherlock Holmes miraculously survives a deadly fight with an opponent based on what real-life criminal?","annoq":"Where in Victoria, Australia is the football club for which Jack Evans is a player based?","annoq_clue_refq":"Where in Victoria, Australia is the football club which Jack Alfred Evans plays for based?"}
{"og_id":"5ab9be4f554299753720f843","contexts_w_ans":"Khunyang Chhish or Kunyang Chhish (Urdu: ‎ )is the second-highest <ans> mountain <ans> in the Hispar Muztagh, a subrange of the Karakoram <ans> mountain <ans>s of Pakistan. Alternate variations of the name include Kunyang Kish and Khiangyang Kish, among others. Its height, also sometimes given as 7823 m , is ranked 21st in the world and 8th in Pakistan. <sep> Ismoil Somoni Peak (Tajik: Қуллаи Исмоили Сомонӣ, \"Qulla-i Ismō‘il-i Sōmōnî\/Qullaji Ismojili Somonī\"; Persian: قلّهٔ اسماعیل سامانی‎ ‎ ; Russian: пик Исмаила Самани \"pik Ismaila Samani\") is the highest <ans> mountain <ans> in Tajikistan. It was within the territory of the former Russian Empire and the former Soviet Union before the area became independent as Tajikistan. The <ans> mountain <ans> is named after Ismail Samani, a ruler of the Samanid dynasty.","refq":"What land elevation does Khunyang Chhish and Ismoil Somoni Peak have in common?","1hop_q":"What type of natural formation is Khunyang Chhish?","non_q":"\"Kunyang Chhish and Ismoil Somoni Peak are prominent mountains in Pakistan and Tajikistan.\"","random_q":"Wing warping, a system for lateral aircraft control, was pioneered by the Wright brothers during their first controlled, sustained flight near which now-famous location?","annoq":"What type of natural formations are Khunyang Chhish and Ismoil Somoni Peak?","annoq_clue_refq":"What type of natural formations are Khunyang Chhish and Ismoil Somoni Peak?"}
{"og_id":"5ab931475542991b5579f12f","contexts_w_ans":"The Jacksonville transportation network includes ground, air, and sea options for passenger and freight transit. The Jacksonville Port Authority (Jaxport) operates the Port of Jacksonville, which includes container shipping facilities at \"Blount Island Marine Terminal\", the \"Talleyrand Marine Terminal\" and the \"Dames Point Marine Terminal\". Jacksonville Aviation Authority managers Jacksonville International Airport in Northside, as well as several smaller airports. The Jacksonville Transportation Authority (JTA) operates bus, people mover, and park-n-ride services throughout the city and region. A major bus terminal at the intermodal Rosa Parks Transit Station serves as JTA's main transit hub. Various intercity bus companies terminate near Central Station. Amtrak operates passenger rail service to and from major cities throughout North America. The city is bisected by major highways, I-95 and I-10, I-295 creates a full beltway around the city. <sep> Jacksonville International Airport (IATA: JAX, ICAO: KJAX, FAA LID: JAX) is a civil-military public airport 13 miles (21 km) north of Downtown Jacksonville, in <ans> Duval County <ans>, Florida. It is owned and operated by the Jacksonville Aviation Authority.","refq":"Which country in Florida is the airport associated with transportation in Jacksonville, Florida?","1hop_q":"What county is Jacksonville International Airport located in?","non_q":"\"Jacksonville, Florida, offers a diverse transportation network, including a major airport and smaller airports.\"","random_q":"The airline featured in \"Bombing Hitler's Dams\" is based in which country? ","annoq":"In which county is the major airport operated by the Jacksonville transportation network located?","annoq_clue_refq":"Where in Florida is the major airport run by the Jacksonville transportation network located?"}
{"og_id":"5a7d19d85542995ed0d165e8","contexts_w_ans":"The Southeastern Conference (SEC) is an American college athletic conference whose member institutions are located primarily in the Southern part of the United States. Its fourteen members include the flagship public universities of ten states, three additional public land grant universities, and one private research university. The conference is headquartered in <ans> Birmingham, Alabama <ans>. The SEC participates in the National Collegiate Athletic Association (NCAA) Division I in sports competitions; for football, it is part of the Football Bowl Subdivision (FBS), formerly known as Division I-A. <sep> The 1984 Tennessee Volunteers football team (variously \"Tennessee\", \"UT\" or the \"Vols\") represented the University of Tennessee in the 1984 NCAA Division I-A football season. Playing as a member of the Southeastern Conference (SEC), the team was led by head coach Johnny Majors, in his eighth year, and played their home games at Neyland Stadium in Knoxville, Tennessee. They finished the season with a record of seven wins, four losses and one tie (7–4–1 overall, 3–3 in the SEC) and a loss against Maryland in the Sun Bowl. The Volunteers offense scored 327 points while the defense allowed 276 points.","refq":"The Tennessee Volunteers football team plays as a member for a conference in what city?","1hop_q":"Where is the SEC conference is headquartered?","non_q":"The Tennessee Volunteers football team played as a member of the Southeastern Conference.","random_q":"Who owns the airport  which was the destination of American Airlines Flight 514?","annoq":"Where is the headquarters of the athletic conference in which the 1984 Tennessee Volunteers was a member?","annoq_clue_refq":"Where is the conference, for which the Tennessee Volunteers football team played as a member, based?"}
{"og_id":"5ab44a775542991779162c57","contexts_w_ans":"Otello (] ) is an opera in four acts by Giuseppe Verdi to an Italian libretto by Arrigo Boito, based on Shakespeare's play \"Othello\". It was Verdi's penultimate opera, and was first performed at the <ans> Teatro alla Scala <ans>, Milan, on 5 February 1887. <sep> After Aida (original title: \"Verdi's Messiah\") is a 1985 play-with-music by Julian Mitchell. It is about Giuseppe Verdi, and the pressure put upon him after his attempt to retire from composing. Continued insistent prodding from his friends eventually results in one of his greatest masterpieces, the opera \"Otello\", which premiered in 1887.","refq":"Where was the opera, which was the subject of After Aida, first performed?","1hop_q":"Where in Milan was Otello first performed on February 5, 1887?","non_q":"\"Otello\", first performed in 1887, was depicted in \"After Aida\" as of Verdi's most successful operas.","random_q":"Who starred in Rough Magic that wasborn 7 April 1964?","annoq":"Where in Milan did the musician, who is the focus of \"After Aida\", conduct his penultimate opera in 1887?","annoq_clue_refq":"Where did the musician, who is the focus of \"After Aida\", first performed his 1887 opera?"}
{"og_id":"5a8ac44055429970aeb70304","contexts_w_ans":"Cher ( ; born Cherilyn Sarkisian; May 20, 1946) is an American singer and actress. Sometimes referred to as the Goddess of Pop, she has been described as embodying female autonomy in a male-dominated industry. She is known for her distinctive contralto singing voice and for having worked in numerous areas of entertainment, as well as adopting a variety of styles and appearances during her five-decade-long career. <sep> If These Walls Could Talk is a 1996 made-for-cable film, broadcast on HBO. It follows the plights of three different women and their experiences with abortion. Each of the three stories takes place in the same house, 22 years apart: 1952, 1974, and 1996. All three segments were co-written by Nancy Savoca. Savoca directed the first and second segment while Cher directed <ans> the third <ans>. The women's experiences in each vignette are designed to demonstrate the popular views of society on the issue in each of the given decades.","refq":"Which segment of If These Walls Could Talk did the Goddess of Pop direct?","1hop_q":"Which segment of the film *If These Walls Could Talk* was directed by Cher?","non_q":"Cher, also known as the \"Goddess of Pop\", directed the third segment of If These Walls Could Talk.","random_q":"The song Treat You Better was included in an album that debuted where on the US \"Billboard\" 200?","annoq":"Which segment of the 1996 movie about women's experiences with abortion was directed by the 'Goddess of Pop'?","annoq_clue_refq":"Which segment of \"If These Walls Could Talk\" was directed by the 'Goddess of Pop'?"}
{"og_id":"5a74397055429974ef308bbe","contexts_w_ans":"The 1996–97 NBA season was the Spurs' 21st season in the National Basketball Association, and 30th season as a franchise. During the offseason, the Spurs signed free agent and former All-Star Dominique Wilkins, who played in Greece last season, while re-signing free agent Vernon Maxwell. However, without All-Star center David Robinson, who played just six games due to back and foot injuries, and Chuck Person, who was out for the entire season with an offseason back injury, the Spurs struggled losing 13 of their first 15 games in November. After 18 games, head coach <ans> Bob Hill <ans> was fired and replaced with General Manager Gregg Popovich. Wilkins appeared in 63 games and led the team with 18.2 points per game. However, it would not be nearly enough as the Spurs finished sixth in the Midwest Division with an awful 20–62 record. <sep> Gregg Charles Popovich (born January 28, 1949) is an American basketball coach who is currently the head coach of the San Antonio Spurs of the National Basketball Association (NBA). Taking over as coach of the Spurs in 1996, Popovich is the longest tenured active coach in both the NBA and all US major sports leagues. He is often referred to as \"Coach Pop\" or simply \"Pop.\"","refq":"which coach did the longest tenured active coach in both the NBA and all US major sports leagues replaced in 1996?","1hop_q":"Who was fired after 18 games and replaced with General Manager Gregg Popovich?","non_q":"In 1996, Coach Pop replaced the NBA coach and since then become the longest-tenured active coach in both the NBA and all US major sports leagues.","random_q":"Are both A Midsummer Night's Dream and La sonnambula operas?","annoq":"Which former basketball coach of the Spurs was replaced by 'Coach Pop'?","annoq_clue_refq":"In 1996, which NBA coach was replaced by the coach who is now the longest tenured active coach in both the NBA and all US major sports leagues?"}
{"og_id":"5ac375495542995ef918c1a3","contexts_w_ans":"Roman Sergeyevich Kostomarov (Russian: Роман Серге́евич Костомаров , born 8 February 1977) is a Russian ice dancer. With partner Tatiana Navka, he is the 2006 Olympic champion, two-time World champion (2004–05), three-time Grand Prix Final champion (2003–05), and three-time European champion (2004–06). <sep> Ekaterina Alexeyevna Davydova (Russian: Екатерина Алексеевна Давыдова , born 17 September 1978) is a Russian former competitive ice dancer. She is the 1996 World Junior champion with <ans> Roman Kostomarov <ans>. She also skated with Vazgen Azroyan.","refq":"Ekaterina Alexeyevna Davydova skated with which 2006 Olympic champion, two-time World champion, three-time Grand Prix Final champion, and three-time European champion?","1hop_q":"Who is the 1996 World Junior champion ice dancer that Ekaterina Alexeyevna Davydova skated with?","non_q":"Ekaterina Alexeyevna Davydova skated with Roman Kostomarov, the 2006 Olympic champion, two-time World champion, three-time Grand Prix Final champion, and three-time European champion.","random_q":"What is the population of the small town with an Air Force Base 7 mi northeast of Sacramento, California?","annoq":"Which former dance partner of Ekaterina Davydova later became the 2006 Olympic champion with Tatiana Navka?","annoq_clue_refq":"Who skated with Ekaterina Alexeyevna Davydova and later became the 2006 Olympic champion, two-time World champion, and three-time Grand Prix Final champion?"}
{"og_id":"5add38355542990dbb2f7dd0","contexts_w_ans":"Jillian Faye Hall (\"née\" Fletcher; September 6, 1980) is an <ans> American <ans> <sep> A Jingle with Jillian is an Extended play (EP) by WWE female wrestler Jillian. The EP was released by WWE Records on December 11, 2007. Hall performed all the songs in her character of a poor singer. The album reached number 20 on the UK Holidays Top 100 shortly after its release before climbing onto the Top 50 albums on iTunes.","refq":"What is the nationality of the wrestler who sang on A Jingle with Jillian?","1hop_q":"What nationality is Jillian Faye Hall?","non_q":"Jillian, the wrestler, released a EP called \"A Jingle with Jillian\" in 2007.","random_q":"As of 2017, what was the estimated value of the basketball team that Luke Theodore Walton coaches?","annoq":"What is the nationality of the singer of \"A Jingle with Jillian\"?","annoq_clue_refq":"What is the nationality of the wrestler who sang \"A Jingle with Jillian\"?"}
{"og_id":"5a8ac02d5542996c9b8d5f6f","contexts_w_ans":"The Oregon Duck is the mascot of the University of Oregon Ducks athletic program, based on Disney's Donald Duck character through a special license agreement. The mascot wears a <ans> green and yellow <ans> costume, and a <ans> green and yellow <ans> beanie cap with the word \"Oregon\" on it. <sep> The Oregon Ducks are the athletic teams that represent the University of Oregon in Eugene, Oregon. The Ducks compete at the National Collegiate Athletic Association (NCAA) Division I level as a member of the Pac-12 Conference. With eighteen varsity teams, Oregon is best known for its American football team and track and field program, which has helped Eugene gain a reputation as \"Track Town, USA\". Oregon's main rivalries are with the Oregon State Beavers (the Civil War) and the Washington Huskies.","refq":"What colors are worn by the Oregon Duck, mascot of the University of Oregon athletic teams?","1hop_q":"What colors does the mascot of the University of Oregon Ducks athletic program wear?","non_q":"The University of Oregon Ducks athletic teams are represented by the Oregon Duck mascot.","random_q":"When did the man who Lord Frederick Charles Cavendish was a protege of last serve as Prime Minister?","annoq":"What are the colors of the mascot representing the athletic teams that contribute to Eugene's reputation as \"Track Town, USA\"?","annoq_clue_refq":"What are the colors of the mascot representing the athletic teams that contribute to Eugene's reputation as \"Track Town, USA\"?"}
{"og_id":"5a84aca95542992a431d1a89","contexts_w_ans":"ESPN and ESPN2's coverage of Thoroughbred racing consisted of NTRA Racing to the Kentucky Derby., Road To The World Thoroughbred Championships\/NTRA Racing to the Breeders' Cup, a series of prep races for the Breeders' Cup World Thoroughbred Championships, the post position draw for the Kentucky Derby and Preakness Stakes, the Kentucky Derby and Belmont Stakes undercard races, the Kentucky Oaks and Black-Eyed Susan Stakes, NTRA 2Day At the Races, Racing Across America, the Preakness undercard races, the Eclipse Awards show, and Long John Silver's Wire to Wire (previously known as RaceHorse Digest), a weekly thoroughbred racing magazine show. They also had Triple Crown morning shows such as Breakfast at Churchill Downs and Breakfast at Pimlico. ESPN also broadcast NTRA Super <ans> Saturday <ans>s as well. <sep> The Kentucky Derby is a horse race that is held annually in Louisville, Kentucky, United States, on the first <ans> Saturday <ans> in May, capping the two-week-long Kentucky Derby Festival. The race is a Grade I stakes race for three-year-old Thoroughbreds at a distance of one and a quarter miles (2 km) at Churchill Downs. Colts and geldings carry 126 lb and fillies 121 lb .","refq":"What is the day of the horse race of which ESPN covers both the post position draw and the undercard races?","1hop_q":"What day did ESPN broadcast NTRA Super Saturdays?","non_q":"ESPN's coverage of racing includes post position draw, undercard races, and horse race events.","random_q":"The village and civil parish Keisley is a hamlet in is mostly had a population of what in 2011?","annoq":"On which day is the horse race, whose post position draw is broadcasted by ESPN, held?","annoq_clue_refq":"On which day is the horse race, whose post position draw and undercard races are broadcasted by ESPN, organized?"}
{"og_id":"5ab94fa25542996be2020474","contexts_w_ans":"\"Speed of Sound\" is a song by British rock band Coldplay. It was written by all members of the band for their third studio album, \"X&Y\" (2005). Built around a piano riff, the song builds into a huge, synthesiser-heavy chorus. It was released by Parlophone Records as the lead single from the album. \"Speed of Sound\" was released in the US on 18 April 2005, and then made its radio premiere on BBC Radio 1 with Lamacq on the day of the release on 19 April. The single was pressed with two B-sides: \"Things I Don't Understand\" and \"Proof\". The song premiered in the UK on 23 May. <sep> X&Y (stylized as X & Y) is the third studio album by the British rock band Coldplay. It was released on 6 June 2005 by Parlophone in the United Kingdom, and a day later by Capitol Records in the United States. The album was produced by Coldplay and producer Danton Supple. It is noted for its troubled and urgent development, with producer Ken Nelson having originally been tasked with producing much of the album; however, many songs written during his sessions were discarded owing to the band's dissatisfaction with them. The album's cover art is a combination of colours and blocks, which is a representation of the <ans> Baudot code <ans>.","refq":"What is represented on the cover art of the studio album that includes the song \"Speed of Sound\"?","1hop_q":"What is the representation of the album's cover art?","non_q":"\"Speed of Sound\" is the lead song in a studio album with a unique cover art design.","random_q":"Kannan Balakrishnan is an exponent of an instrument that is the primary rhythmic accompaniment in which music ensemble ?","annoq":"What does the cover art of the album whose lead single is \"Speed of Sound\" represent?","annoq_clue_refq":"What does the cover art of the studio album featuring the song \"Speed of Sound\" represent?"}
{"og_id":"5a83316b5542993344745fe5","contexts_w_ans":"Joseph Scott Galloway (born November 20, 1971) is a former American football wide receiver in the National Football League and current college football analyst with ESPN. He was drafted by the Seattle Seahawks eighth overall in the 1995 NFL Draft and also played for the Dallas Cowboys, Tampa Bay Buccaneers, New England Patriots, Pittsburgh Steelers and Washington Redskins. He played college football at Ohio State. <sep> ESPN College Football Friday Primetime is a live game presentation of Division 1-A college football on ESPN or sometimes ESPN2. There is no main sponsor. The game telecast airs every Friday night at 7:45pm ET during the college football regular season. In 2017, the games will be announced by Adam Amin and Dusty Dvoracek. The game is preceded by a 5-10 minute long segment of \"<ans> College Football Scoreboard <ans>\" with Adnan Virk, Danny Kanell and Joey Galloway. They both also present the halftime report.","refq":"What is the name of the show that the man that was drafted eighth overall in the 1995 NFL Draft co-hosts?","1hop_q":"What is the name of the segment preceding the College Football Friday Primetime game?","non_q":"Joey Galloway was drafted eighth overall in the 1995 NFL Draft.","random_q":"What Conference did Jordan Phillips play in in college?","annoq":"What segment of ESPN College Football Friday Primetime is presented by the former football player drafted eighth by the Seattle Seahawks in 1995?","annoq_clue_refq":"What segment of ESPN College Football Friday Primetime is co-hosted by the player drafted eighth in the 1995 NFL Draft?"}
{"og_id":"5a888b8e5542997e5c09a60a","contexts_w_ans":"Cardinal Hayes High School is a Catholic high school for boys in the Concourse Village neighborhood of the Bronx, New York City. The school serves the Roman Catholic Archdiocese of New York. It is a member of the CHSAA. It was constructed in the Art Deco style. It is named after Cardinal Patrick Joseph Hayes, a previous archbishop of (Catholic Archdiocese of) New York. <sep> The Catholic High School Athletic Association or CHSAA is a high school athletic association made up of Catholic high schools based in <ans> New York City, Long Island, and Westchester <ans>. It is the largest Catholic high school athletic league in the United States.","refq":"Where are schools in the athletic association Cardinal Hayes High School is part of located?","1hop_q":"Which areas are the Catholic high schools that are part of the CHSAA based in?","non_q":"Cardinal Hayes High School is part of the Catholic High School Athletic Association.","random_q":"Edmund Veesenmayer served under a senior the highest ranking officer in which part of the Nazi German army?","annoq":"The athletic association for Catholic schools, of which Cardinal Hayes High School is a member, consist of schools from which regions?","annoq_clue_refq":"The high school athletic association that includes Cardinal Hayes High School consists of schools from which regions?"}
{"og_id":"5ab467975542991751b4d75f","contexts_w_ans":"\"Freaky Like Me\" is an English language song by the Norwegian urban duo Madcon featuring vocals from Belgian-Tunisian singer Ameerah. It is the second single released from their fourth album \"Contraband\". The song was written by Ameerah, TJ Oosterhuis, Arjang \"DreamRoc'a\" Shishegar, Tshawe Baqwa and Yosef Wolde-Mariam and produced by Norwegian producer DreamRoc'a, also known as Sha, and TJ Oosterhuis. It was released on 20 September 2010. The song reached number one in Norway, making it their third number one in the country and their third biggest international hit. <sep> Madcon is a Norwegian musical duo formed in <ans> 1992 <ans> by Yosef Wolde-Mariam and Tshawe Baqwa. To date, they have released six albums.","refq":"When was the duo formed who's English language song is the \"Freaky Like Me\"?","1hop_q":"In which year was Madcon formed?","non_q":"The Norwegian duo, Madcon, formed in 1992, released the English language song \"Freaky Like Me\".","random_q":"The Airth Old Parish Church is located near what body of water?","annoq":"When was the musical duo that released the song \"Freaky Like Me\" formed?","annoq_clue_refq":"When was the duo who performed the English language song \"Freaky Like Me\" formed?"}
{"og_id":"5a7a27ce5542996c55b2dd28","contexts_w_ans":"The Korean War (in South Korean Hangul: 한국전쟁 ; Hanja: 韓國戰爭 ; RR: \"Hanguk Jeonjaeng \" , \"Korean War\"; in North Korean Chosŏn'gŭl: 조국해방전쟁 ; Hancha: 祖國解放戰爭 ; MR: \"Choguk haebang chǒnjaeng \" , \"Fatherland Liberation War\"; 25 June 1950 – 27 July 1953) was a war between North Korea (with the support of China and the Soviet Union) and South Korea (with the principal support of the United States). The war began on 25 June 1950 when North Korea invaded South Korea. The United Nations, with the United States as the principal force, came to the aid of South Korea. China came to the aid of North Korea, and the Soviet Union also gave some assistance to the North. <sep> <ans> The Western Allied invasion of Germany <ans> was coordinated by the Western Allies during the final months of hostilities in the European theatre of World War II. The Allied invasion of Germany started with the Western Allies crossing the Rhine River in March 1945 before fanning out and overrunning all of western Germany from the Baltic in the north to Austria in the south before the Germans surrendered on 8 May 1945. This is known as the \"Central Europe Campaign\" in United States military histories.","refq":"What took place first, The Korean War or The Western Allied invasion of Germany?","1hop_q":"What was coordinated by the Western Allies during the final months of hostilities in the European theatre of World War II?","non_q":"The Western Allied invasion of Germany took place in 1945, while The Korean War occurred in 1950.","random_q":"The Louisville Ballet occasionally performs at the theatre on the east side of which street?","annoq":"Which historical event broke out first, The Korean War or The Western Allied invasion of Germany?","annoq_clue_refq":"Which historical event occurred first, the Korean War or the Western Allied invasion of Germany?"}
{"og_id":"5ac13e195542994ab5c67cc5","contexts_w_ans":"Armin Shimerman (born November 5, 1949) is an American actor, voice actor and author. Shimerman is known for playing the Ferengi bartender Quark in the television series \"\", Principal Snyder in \"Buffy the Vampire Slayer\", <ans> Kramer's caddy Stan <ans> on \"Seinfeld\", for voicing Dr. Nefarious in the \"Ratchet & Clank\" series, and for voicing Andrew Ryan, one of the antagonists of \"BioShock\". <sep> Red Bird is an American Western web series. Created by Misti Boland and Jeremy Osbern, the series stars Alexandra Goodman, Ian Stark, Armin Shimerman, Kitty Swink, Mike McShane, and John Prosky. The series of eight three to five minute episodes premiered on YouTube and the show's website in March 2016.","refq":"One of the actors from the web series Red Bird is also known for what character in the popular television show Seinfeld?","1hop_q":"Who did Armin Shimerman play in \"Seinfeld\"?","non_q":"Armin Shimerman is an actor known for his role in the television series Seinfeld and Red Bird.","random_q":"What position does the basketball player, who appears in the cover of the German version of NBA 2K16, play ?","annoq":"What role did the actor who appeared on \"Red Bird\" play in \"Seinfeld\"?","annoq_clue_refq":"What role did the actor who appeared on the web show \"Red Bird\" play in the television series \"Seinfeld\"?"}
{"og_id":"5a8601f855429960ec39b5fd","contexts_w_ans":"Samuel Jacob Bradford (born November 8, 1987) is an American football quarterback for the Minnesota Vikings of the National Football League (NFL). Bradford attended Putnam City North High School in Oklahoma City, where he starred in football, basketball and golf. As a senior quarterback in 2005, he threw for 2,029 yards and 17 touchdowns in 12 games. Bradford was not highly recruited coming out of high school, but he did receive a scholarship offer from the University of Oklahoma, which he accepted. After a redshirt season in 2006, Bradford threw for 3,121 yards and 36 touchdowns as a redshirt freshman. That set the stage for a phenomenal 2008 year, when Bradford became only the second sophomore to win the Heisman Trophy as he was the trigger man for the highest-scoring offense in NCAA history, throwing for 4,464 yards with 48 touchdowns and just six interceptions. He again led the nation in passing and also added five rushing touchdowns as the Sooners went 12-1 and advanced to the BCS national title game. Bradford declared for the NFL draft following the 2009 season and was drafted by the St. Louis Rams with the first overall pick in the 2010 NFL Draft. <sep> The St. Louis Rams season was the team's <ans> 75th <ans> season in the National Football League, the 18th overall in St. Louis and the first under new head coach Jeff Fisher. Finishing at 7–8–1, they improved on their 2–14 record from 2011. In Week 10 against the San Francisco 49ers, the game ended in a 24–24 tie, the first since the 2008 NFL season. It was Sam Bradford's second and final full season as the Rams starting quarterback as two torn ACLs sidelined him for much of the next season and the entire 2014 season.","refq":"Which St. Louis Rams season was the final full season played by the 2008 winner of the Heisman Trophy?","1hop_q":"In which season of the St. Louis Rams in the NFL did Sam Bradford play the last full season?","non_q":"The final full season played by the 2008 winner of the Heisman Trophy in the 75th season of the St. Louis Rams in the NFL.","random_q":"What Austrian Formula One Team advisor works with a company headquartered in Fuschl am See, Austria?","annoq":"As of one year after picking Samuel Bradford in the 2010 NFL Draft, how many seasons had the St. Louis Rams participated in the NFL?","annoq_clue_refq":"In which season of the St. Louis Rams in the NFL did the player who won the 2008 Heisman Trophy play his final full season for the team?"}
{"og_id":"5a7642f7554299109176e6e8","contexts_w_ans":"<ans> Luca Parmitano <ans> (born 27 September 1976 in Paternò, Sicily) is an Italian engineer and astronaut in the European Astronaut Corps for the European Space Agency (ESA). The astronauts work on missions at the International Space Station. He was selected as an ESA astronaut in May 2009. <sep> Prof. Dr. Ulrich Hans Walter (born February 9, 1954) is a German physicist\/engineer and a former DFVLR astronaut.","refq":"who is younger Ulrich Walter or  Luca Parmitano?","1hop_q":"What is the name of the Italian astronaut in the ESA who was born on 27 September 1976?","non_q":"Luca Parmitano and Ulrich Walter are both engineers and astronauts.","random_q":"What was the nationality of the star of 7 Faces of Dr. Lao?","annoq":"Which of the following astronauts was born later: Ulrich Hans Walter or Luca Parmitano?","annoq_clue_refq":"Who was born later: Ulrich Walter or Luca Parmitano?"}
{"og_id":"5ab6988a554299710c8d1edc","contexts_w_ans":"432 Park Avenue is a residential skyscraper in New York City that overlooks Central Park. Originally proposed to be 1300 ft in 2011, the structure topped out at 1396 ft . It was developed by CIM Group and features 104 condominium apartments. Construction began in 2012 and was completed on December 23, 2015. <sep> The <ans> Metropolitan Life Insurance Company Tower <ans>, colloquially known as the Met Life Tower, is a landmark skyscraper located on Madison Avenue near the intersection with East 23rd Street, across from Madison Square Park in Manhattan, New York City. Designed by the architectural firm of Napoleon LeBrun & Sons and built by the Hedden Construction Company, the tower is modeled after the Campanile in Venice, Italy. The hotel located in the clock tower portion of the building has the address 5 Madison Avenue, while the office building covering the rest of the block, occupied primarily by Credit Suisse, is referred to as 1 Madison Avenue.","refq":"Which building, the Metropolitan Life Insurance Company Tower or the 432 Park Avenue building, has two addresses?","1hop_q":"What is the name of the landmark skyscraper on Madison Avenue commonly known as the Met Life Tower?","non_q":"Unlike the 432 Park Avenue building, the Metropolitan Life Insurance Company Tower building has two addresses.","random_q":"The music and lyrics for Scottsboro Boys was by a team who frequently wrote for performers such as who?","annoq":"Between 432 Park Avenue and the Metropolitan Life Insurance Company Tower, which skyscraper was inspired by a European architecture?","annoq_clue_refq":"Between 432 Park Avenue and the Metropolitan Life Insurance Company Tower, which building has multiple addresses?"}
{"og_id":"5ab55455554299488d4d993b","contexts_w_ans":"Mount Stimson (10142 ft ) is the second highest peak in Glacier National Park, located in Montana, United States. It is part of the Lewis Range, which spans much of the park. It is located in the remote southwestern portion of the park, approximately 5 mi west of the Continental Divide and 12 mi southeast of Lake McDonald. It is drained by Pinchot Creek (on the south) and Nyack Creek (on the other sides), both of which flow into the Middle Fork of the Flathead River. <sep> Glacier National Park is a national park located in the U.S. state of Montana, on the Canada–United States border with the Canadian provinces of Alberta and British Columbia. The park encompasses <ans> over 1 million <ans> acre and includes parts of two mountain ranges (sub-ranges of the Rocky Mountains), over 130 named lakes, more than 1,000 different species of plants, and hundreds of species of animals. This vast pristine ecosystem is the centerpiece of what has been referred to as the \"Crown of the Continent Ecosystem\", a region of protected land encompassing 16000 mi2 . The current Superintendent is Jeff Mow.","refq":"Mount Stimson is the second highest peak in national park that encompasses how many acres?","1hop_q":"How many acres does Glacier National Park encompass?","non_q":"\"Mount Stimson is the second highest peak in Glacier National Park.\"","random_q":"In what city did the worst accident of the Air France airline originate from?","annoq":"What is the area, in acres, of the national park where Mount Stimson is located?","annoq_clue_refq":"How many acres does the national park where Mount Stimson is the second highest peak encompass?"}
{"og_id":"5ade811e5542992fa25da7a0","contexts_w_ans":"Moby-Dick; or, The Whale is a novel by American writer Herman Melville, published in <ans> 1851 <ans> during the period of the American Renaissance. Sailor Ishmael tells the story of the obsessive quest of Ahab, captain of the whaler \"Pequod\", for revenge on Moby Dick, the white whale that on the previous whaling voyage bit off Ahab's leg at the knee. The novel was a commercial failure and out of print at the time of the author's death in 1891, but during the 20th century, its reputation as a Great American Novel was established. William Faulkner confessed he wished he had written it himself, and D. H. Lawrence called it \"one of the strangest and most wonderful books in the world\", and \"the greatest book of the sea ever written\". \"Call me Ishmael\" is among world literature's most famous opening sentences. <sep> Marvel Classics Comics was an American comics magazine which ran from 1976 until 1978. It specialized in adaptations of literary classics such as \"Moby-Dick\", \"The Three Musketeers\", and \"The Iliad\". It was Marvel Comics' attempt to pick up the mantle of \"Classics Illustrated\", which stopped publishing in 1971. 36 issues of \"Marvel Classics Comics\" were published, 12 of them being reprints of another publisher's work.","refq":"Marvel Classics Comics specialized in adaptations of literary classics, such as a novel by American writer Herman Melville, that was published in what year?","1hop_q":"In what year was \"Moby-Dick\" published?","non_q":"\"Herman Melville was an American writer who published the novel 'Moby-Dick', before Marvel Comics adapted it.\"","random_q":"Who was born first,  Rómulo Gallegos or Beatrix Potter?","annoq":"When was the novel that was adapted into comics by Marvel Classics Comics, alongside \"The Three Musketeers\" and \"The Iliad\", published?","annoq_clue_refq":"When was the novel written by American writer Herman Melville and adapted by Marvel Classics Comics, which specialized in comic adaptations of literary classics, published?"}
{"og_id":"5abd14c455429924427fceec","contexts_w_ans":"Victoria Symphony Splash is an annual event held in Victoria, British Columbia on the Sunday before BC Day. The event is produced by the Victoria Symphony and consists of the Victoria Symphony playing, live on a barge, in the middle of Victoria's Inner Harbour. Also included in the event is a very large fireworks display, as well as live cannon fire, during the 1812 Overture. The concert is led by Victoria Symphony Music Director <ans> Tania Miller <ans>. The 2016 event on July 31 will be the 27th Victoria Symphony Splash. <sep> The Year 1812, festival overture in E♭ major, Op. 49, popularly known as the 1812 Overture, is an overture written in 1880 by Russian composer Pyotr Ilyich Tchaikovsky to commemorate Russia's defence of its motherland against Napoleon's invading Grande Armée in 1812.","refq":"Who will conduct the firing cannons in Victoria as part of a musical piece written to celebrate the defeat of Napoleon in Russia?","1hop_q":"Who is the music director of the Victoria Symphony Splash?","non_q":"The Victoria Symphy Splash features live cannon fire as part of a musical piece written to celebrate the defeat of Napoleon in Russia.","random_q":"What is the year of the event that occured second, Charles Le Grice was born, or Samuel Coleridge was born?","annoq":"Who leads the annual concert in Victoria, British Columbia, that features an overture commemorating Russia's defense against Napoleon's invasion in 1812?","annoq_clue_refq":"Who directs the festival in Victoria, which features cannon fire during the performance of the musical piece about Russia's battle against Napoleon's invasion in 1812?"}
{"og_id":"5adf8dd25542993344016cfe","contexts_w_ans":"Blue Valley Northwest High School (BVNW) is a high school in Overland Park, Kansas, United States. It is part of the Blue Valley Unified School District. Blue Valley Northwest is one of several schools located within the city limits of Overland Park. In the 2009 Newsweek ranking of the top 1,500 high schools in the United States, Blue Valley Northwest was ranked <ans> #364 <ans>, the highest in the district and the state. The school has been ranked in the top 700 since 2005. In 2014, Blue Valley Northwest was selected as one of the six finalists for the first annual Race to the Top High School Commencement Challenge, sponsored by the Department of Education under the Obama administration. <sep> High School Confidential is an eight-part documentary television series created by Sharon Liese, following twelve high school teenagers from Blue Valley Northwest High. The series airs on (WE TV). The original run began on March 10, 2008, and concluded on April 28, 2008.","refq":"High School Confidential, an eight part documentary followed twelve high school teenagers from a high school in Overland Park, Kansas that ranked what in the 2009 Newsweek ranking of the top 1,500 high schools in the United States?","1hop_q":"What was the ranking of Blue Valley Northwest in the 2009 Newsweek ranking of the top high schools in the United States?","non_q":"High School Confidential\" is an eight-part documentary following twelve teenagers of a high school in Overland Park that was ranked #364 in the 2009 Newsweek ranking of the top 1,500 high schools in the United States.","random_q":"The City of Bath Male Choir sang with which English tenor and actor born on 29 September 1973?","annoq":"In Newsweek's 2009 ranking of U.S. high schools, what was the ranking of the high school where the TV series \"High School Confidential\" was filmed?","annoq_clue_refq":"In Newsweek's 2009 ranking of top 1500 U.S. high schools, what was the ranking of the high school in Overland where \"High School Confidential\", an eight-part documentary following twelve teenagers, was filmed?"}
{"og_id":"5a8ce9ed554299585d9e3764","contexts_w_ans":"Miranda Leigh Lambert (born November 10, 1983) is an American singer and songwriter. Outside her solo career, she is a member of the Pistol Annies alongside Ashley Monroe and Angaleena Presley. Lambert has been honored by the Grammy Awards, the Academy of Country Music Awards, and the Country Music Association Awards. <sep> Ashley Lauren Monroe is an American country music singer-songwriter. She has released two solo singles on the U.S. \"Billboard\" Hot Country Songs chart. The singles \"Satisfied\" and \"I Don't Want To\" (which featured Brooks & Dunn singer Ronnie Dunn) reached No. 43 and No. 37, respectively. Both singles were intended to be released on Monroe's debut album, \"Satisfied\", in 2007, but the album went unreleased. Monroe left Columbia Records' roster in late 2007, and \"Satisfied\" was finally released on May 19, 2009. In June 2011, Monroe, <ans> Miranda Lambert <ans> and Angaleena Presley formed a band called Pistol Annies. Monroe's second studio album, \"Like a Rose\", was released on March 5, 2013 followed by her third album \"The Blade\", released on July 24, 2015.","refq":"Which American singer and songwriter born in 1983 formed the band Pistol Annies with Ashley Monroe and a third band member?","1hop_q":"In 2011, who formed a band called Pistol Annies together with Ashley Monroe and Angaleena Presley?","non_q":"Miranda Lambert, born in 1983, is an American singer and member of Pistol Annies.","random_q":"From the age of 14 Bate lived on the family property \"Mountain View\" at these villages. It was the site for which television series?","annoq":"Which bandmate of the singer who released \"Satisfied\" and \"I Don't Want To\" was born on November 10, 1983?","annoq_clue_refq":"Which member of Pistol Annies, the band Ashley Monroe joined before releasing her third album, is an American singer and songwriter born in 1983?"}
{"og_id":"5a76244c554299109176e65d","contexts_w_ans":"<ans> A Rush of Blood to the Head <ans> is the second studio album by the British rock band Coldplay. It was released on 26 August 2002 by Parlophone in the United Kingdom, and a day later by Capitol Records in the United States. The album was produced by the band and producer Ken Nelson. Recording started after the band became popular worldwide with the release of their debut album \"Parachutes\" (2000), and one of its singles in particular, \"Yellow\". The album makes greater use of electric guitar and piano than its predecessor. <sep> \"Yellow\" is a song by the British rock band Coldplay. The band wrote the song and co-produced it with British record producer Ken Nelson for their debut album, \"Parachutes\" (2000). The song's lyrics are a reference to the band's lead singer Chris Martin's unrequited love.","refq":"What was the album by Coldplay after the one with a song referencing Chris Martin's unrequited love?","1hop_q":"What is the title of the second studio album by the British rock band Coldplay?","non_q":"Coldplay's song about Chris Martin's unrequited love has facilitated the recording and release of their second album.","random_q":"Where is the singer and songwriter who recorded a demo of \"Love the Way You Lie\" alongside Alex da Kid from?","annoq":"The recording of which album by Coldplay was facilitated by the success of the band's debut song about unrequited love?","annoq_clue_refq":"The recording of which album by Coldplay was facilitated by one of their early songs about Chris Martin's unrequited love?"}
{"og_id":"5a83880e554299123d8c214e","contexts_w_ans":"Ghost Rider is a song by the protopunk band Suicide appearing on their debut album. The song is based on the <ans> Marvel <ans> Comics character. <sep> Suicide is the debut album from the American rock band Suicide. It was released in 1977 on Red Star Records and produced by Craig Leon and Marty Thau. The album was recorded in four days at Ultima Sound Studios in New York and featured Martin Rev's minimalist electronics and harsh, repetitive rhythms paired with Alan Vega's rock and roll-inspired vocals and depictions of urban life.","refq":"Suicide's 1977 released album features a song based on what brand's comic character?","1hop_q":"A character from compic publisher inspires the writing of the song \"Ghost Rider\"?","non_q":"Suicide's 1977 album features a song based on a comic character.","random_q":"The Chain starred an American actor who has appeared in over 150 films. What did the actor make guest appearences on?","annoq":"Which comic publisher inspired the writing of a song in an album produced by Craig Leon and Marty Thau, released in 1977?","annoq_clue_refq":"Which comic publisher inspired the writing of a song in the Suicide's featured album released in 1977?"}
{"og_id":"5a72944c5542994cef4bc351","contexts_w_ans":"Michael Lewis Greenwell (born July 18, 1963) is a former left fielder in Major League Baseball who played his entire MLB career with the Boston Red Sox (1985–1996). He played a few games for the Hanshin Tigers in Japan (1997), before retiring. Greenwell was nicknamed \"The Gator.\" He batted left-handed and threw right-handed. He was voted fourth in Rookie of the Year voting in 1987. Greenwell was a leading contender for the AL MVP in 1988, but he lost out to José Canseco, who pulled off the first 40 home run, 40 stolen base season in baseball history. Greenwell hit .325 with 22 HR and 119 RBI in 1988, setting career highs in all three categories. <sep> City of Palms Park is a stadium in Fort Myers, Florida primarily used for baseball, although the City of Fort Myers uses the venue for the occasional concert. It served as the spring training home of the Boston Red Sox from its opening in 1993 to 2011. Former Boston Red Sox left fielder <ans> Mike Greenwell <ans> is from Fort Myers, and was instrumental in bringing his team to the city for spring training. The stadium was built in 1992 for that purpose and holds 8,000 people. It was also the home of the Red Sox Rookie team, the Gulf Coast League Red Sox, from April through June. The stadium's name is taken from the city's official nickname.","refq":"What man, born in 1963, was instrumental in bringing the Boston Red Sox to the stadium City of Palms Park in Fort Myers, Florida?","1hop_q":"Who was instrumental in bringing the Boston Red Sox to the city for spring training?","non_q":"Mike Greenwell, born in 1963, was instrumental in bringing the Red Sox to the stadium City of Palms Park in Fort Myers, Florida.","random_q":"Which owner of Chartwell led Britain to victory during World War II?","annoq":"Which MLB player from Fort Myers, who played his entire career for the same team, often trains at the City of Palms Park stadium in the spring?","annoq_clue_refq":"Which Boston Red Sox player from Fort Myers, born in 1963, was instrumental in bringing the team to the City of Palms Park stadium?"}
{"og_id":"5a7757215542993569682d58","contexts_w_ans":"Lucy Elizabeth Fry (born 13 March 1992) is an Australian actress. She is known for portraying Zoey in \"Lightning Point\", Lyla in \"\", and Vasilisa Dragomir in the film \"Vampire Academy\". Fry was also cast in Hulu's eight part miniseries \"11.22.63\" as Marina Oswald, wife of Lee Harvey Oswald, and played the lead in the 2016 Australian horror television series \"Wolf Creek\". <sep> <ans> Mr. Church <ans> is a 2016 American dramedy film directed by Bruce Beresford and written by Susan McMartin. The film stars Eddie Murphy as the title character with Britt Robertson, Xavier Samuel, Lucy Fry, Christian Madsen and Natascha McElhone also starring. The film debuted on April 22, 2016, at the Tribeca Film Festival and was released on September 16, 2016, by Cinelou Releasing and Freestyle Releasing.","refq":"What 2016 film stars actor Xavier Samuel and an actress who portrayed Vasilisa Dragomir in the film \"Vampire Academy\"?","1hop_q":"Which 2016 film, starring Eddie Murphy as the title character, was directed by Bruce Beresford?","non_q":"Lucy Fry, an actress portraying Vasilisa Dragomir in \"Vampire Academy\", stars in a 2016 film with actor Xavier Samuel.","random_q":"Are FPT University in Vietnam and Kathmandu's Tribhuvan University both public universities?","annoq":"Which 2016 movie, starring Eddie Murphy as the title character, also features the Australian actress who played Zoey in \"Lightning Point\"?","annoq_clue_refq":"Which 2016 film, starring Xavier Samuel, also features the actress who portrayed Vasilisa Dragomir in the film \"Vampire Academy\"?"}
{"og_id":"5ab3063e554299753aec58fe","contexts_w_ans":"The 1992 FA Cup Final was contested by Liverpool and Sunderland at Wembley. Liverpool won 2–0, with goals from Michael Thomas and <ans> Ian Rush <ans>. <sep> Ian James Rush, {'1': \", '2': \", '3': \", '4': \"} (born 20 October 1961) is a retired Welsh professional footballer who played as a forward. At club level Rush played for Liverpool F.C. from 1980–1987 and 1988–1996. He is the club's all-time leading goalscorer, having scored a total of 346 goals in all competitions at the club, including a record 25 goals versus Merseyside derby rival Everton F.C.. At international level, Rush made 73 appearances for the Wales national football team and remains the record goalscorer for his country with 28 goals between 1980 and 1996.","refq":"Which goal scoring player in the 1992 FA Cup Final was Welsh?","1hop_q":"Besides Michael Thomas, who scored a goal for Liverpool in the 1992 FA Cup Final?","non_q":"\"In the 1992 FA Cup Final, goals were scored by Welsh forward Ian Rush.\"","random_q":"Which film premiered more recently, Sweet Crude or My Generation?","annoq":"Which goalscorer of the 1992 FA Cup Final becomes Liverpool's all-time leading goalscorer?","annoq_clue_refq":"Which Welsh player scored a goal in the 1992 FA Cup Final?"}
{"og_id":"5ac312ee5542995ef918c0ec","contexts_w_ans":"Hatyapuri (1979) a crime novel by Satyajit Ray gets its title from a location (\"Puri\") on the shores of the Bay of Bengal which is a popular tourist attraction in East India. <sep> Satyajit Ray (Bengali: সত্যজিৎ রায় , ] ; 2 May 1921 – 23 April 1992) was an <ans> Indian <ans> filmmaker and author, widely regarded as one of the greatest filmmakers of the 20th century. Ray was born in the city of Calcutta into a Bengali Brahmo family which was prominent in the field of arts and literature. Starting his career as a commercial artist, Ray was drawn into independent filmmaking after meeting French filmmaker Jean Renoir and viewing Vittorio De Sica's Italian neorealist film \"Bicycle Thieves\" (1948) during a visit to London.","refq":"Hatyapuri was a novel by the filmmaker of what nationality?","1hop_q":"What nationality was Satyajit Ray?","non_q":"\"Hatyapuri was a novel by filmmaker Satyajit Ray, known for independent filmmaking.\"","random_q":"Ethan Hardy has had a romantic storyline alonside the character played by which star of Waterloo Road and Hollyoaks?","annoq":"What is the nationality of the writer of Hatyapuri?","annoq_clue_refq":"What is the nationality of the filmmaker who wrote Hatyapuri?"}
{"og_id":"5a7caae75542996dd594b971","contexts_w_ans":"<ans> Anabolic steroids <ans>, also known more properly as anabolic–androgenic steroids (AAS), are steroidal androgens that include natural androgens like testosterone as well as synthetic androgens that are structurally related and have similar effects to testosterone. They are anabolic and increase protein within cells, especially in skeletal muscles, and also have varying degrees of androgenic and virilizing effects, including induction of the development and maintenance of masculine secondary sexual characteristics such as the growth of the vocal cords and body hair. The word \"anabolic\", referring to anabolism, comes from the Greek ἀναβολή \"anabole\", \"that which is thrown up, mound.\" They are one of three types of sex hormone agonists, the others being estrogens like estradiol and progestogens like progesterone. <sep> Anabolic\/androgenic steroids are drugs that are obtained from the male hormone, testosterone. <ans> Anabolic steroids <ans> are used for muscle-building and strength gain for cosmetic reasons as well as for performance-enhancement in athletics and bodybuilding. <ans> Anabolic steroids <ans> work in many ways by increasing protein synthesis in the muscles and by eliminating the catabolic process (the process of breaking down skeletal muscle for energy). It is common for teens and adults to use steroids as they stimulate and encourage muscle growth much more rapidly than natural body building.","refq":"What, known as AAS, is commonly used in bodybuilding?","1hop_q":"What are steroidal androgens that include natural and synthetic androgens with anabolic and androgenic effects?","non_q":"Anabolic steroids, known as AAS, are commonly used in bodybuilding.","random_q":"Does Vasek Pospisil have a higher tennis World singles ranking than Michael Stich?","annoq":"Which type of drugs facilitates muscle growth and the development of  masculine secondary sexual characteristics?","annoq_clue_refq":"Which substances, also known as AAS, are commonly used in bodybuilding?"}
{"og_id":"5a7a43245542994f819ef19d","contexts_w_ans":"Christopher Charles Lloyd (born April 30, <ans> 1982 <ans>), better known by his stage name Lloyd Banks, is an American hip hop recording artist and member of East Coast hip hop group G-Unit, alongside childhood friends and fellow American rappers, 50 Cent and Tony Yayo. Raised in South Jamaica, Queens, he dropped out of high school in 1998. G-Unit released two albums, \"Beg for Mercy\" in 2003 and \"T.O.S. (Terminate on Sight)\" in 2008. Banks released his first solo album \"The Hunger for More\" in 2004 with the top ten hit single \"On Fire\". He followed with \"Rotten Apple\" in 2006 and left Interscope Records 2009. In 2010 G-Unit signed with EMI to distribute Banks third studio album \"The Hunger for More 2\", which was released on November 22, 2010. <sep> The Cold Corner 2, the eleventh mixtape by American rapper Lloyd Banks, was released on November 8, 2011 for free download. The mixtape features confirmed guest appearances from Prodigy, Styles P and ASAP Rocky. It also includes production from Automatik, Doe Pesci, AraabMuzik, G Sparkz, Beat Butcha, The Jerm, Nick Speed, Dot & Pro and DJ Excellence.","refq":"What is the birth year of the rapper who made The Cold Corner 2?","1hop_q":"In which year was Christopher Charles Lloyd born?","non_q":"Lloyd Banks is a rapper and he made \"The Cold Corner 2\".","random_q":"\"High Maintenance\" is a song that features the lead vocalist of a band that has sold 9.2 million what?","annoq":"In which year was the artist that released the mixtape \"The Cold Corner 2\" born?","annoq_clue_refq":"What is the birth year of the rapper who created \"The Cold Corner 2\"?"}
